apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
/* Common data structure for Master Timer and Slave Timers */

struct stm32_hrtim_timcmn_s
{
  uint32_t base;                 /* The base address of the timer */
  uint64_t fclk;                 /* The frequency of the peripheral clock
                                  * that drives the timer module.
                                  */
  uint8_t prescaler:3;           /* Prescaler */
  uint8_t mode;                  /* Timer mode */
  uint8_t dac:2;                 /* DAC triggering */
  uint8_t reserved:3;
#ifdef CONFIG_STM32_HRTIM_INTERRUPTS
  uint16_t irq;                  /* interrupts configuration */
#endif
#ifdef CONFIG_STM32_HRTIM_DMA
  uint16_t dma;
#endif
#ifdef CONFIG_STM32_HRTIM_DMABURST
  uint32_t dmaburst;
#endif
};

/* Master Timer and Slave Timers structure */

struct stm32_hrtim_tim_s
{
  struct stm32_hrtim_timcmn_s tim; /* Common Timer data */
  void *priv;                      /* Timer private data */
};

/* Master Timer private data structure */

struct stm32_hrtim_master_priv_s
{
  uint32_t reserved;             /* reserved for future use */
};

/* Slave Timer (A-E) private data structure */

struct stm32_hrtim_slave_priv_s
{
#ifdef CONFIG_STM32_HRTIM_FAULTS
  uint8_t flt;                      /* Faults configuration.
                                     * First five bits are fault sources,
                                     * last bit is lock configuration.
                                     */
#ifdef CONFIG_STM32_HRTIM_AUTODELAYED
  uint8_t auto_delayed;              /* Auto-delayed mode configuration */
#endif
#endif
  uint16_t update;                  /* Update configuration */
  uint64_t reset;                   /* Timer reset events */
#ifdef CONFIG_STM32_HRTIM_PWM
  struct stm32_hrtim_pwm_s pwm;     /* PWM configuration */
#endif
#ifdef CONFIG_STM32_HRTIM_CAPTURE
  struct stm32_hrtim_capture_s cap; /* Capture configuration */
#endif
};

#ifdef CONFIG_STM32_HRTIM_FAULTS
/* Structure describes single HRTIM Fault configuration */

struct stm32_hrtim_fault_cfg_s
{
  uint8_t pol:1;                /* Fault polarity */
  uint8_t src:1;                /* Fault source */
  uint8_t filter:4;             /* Fault filter */
  uint8_t lock:1;               /* Fault lock */
  uint8_t _res:1;               /* Reserved */
};

/* Structure describes HRTIM Faults configuration */

struct stm32_hrtim_faults_s
{
#ifdef CONFIG_STM32_HRTIM_FAULT1
  struct stm32_hrtim_fault_cfg_s flt1;
#endif
#ifdef CONFIG_STM32_HRTIM_FAULT2
  struct stm32_hrtim_fault_cfg_s flt2;
#endif
#ifdef CONFIG_STM32_HRTIM_FAULT3
  struct stm32_hrtim_fault_cfg_s flt3;
#endif
#ifdef CONFIG_STM32_HRTIM_FAULT4
  struct stm32_hrtim_fault_cfg_s flt4;
#endif
#ifdef CONFIG_STM32_HRTIM_FAULT5
  struct stm32_hrtim_fault_cfg_s flt5;
#endif
};
#endif

#ifdef CONFIG_STM32_HRTIM_EVENTS
/* Structure describes single HRTIM External Event configuration */

struct stm32_hrtim_eev_cfg_s
{
  uint8_t filter:4;             /* External Event filter */
  uint8_t src:4;                /* External Event source */
  uint8_t pol:1;                /* External Event polarity */
  uint8_t sen:1;                /* External Event sensitivity */
  uint8_t mode:1;               /* External Event mode */
  uint8_t _res:5;
};

/* Structure describes HRTIM External Events configuration */

struct stm32_hrtim_eev_s
{
#ifdef CONFIG_STM32_HRTIM_EEV1
  struct stm32_hrtim_eev_cfg_s eev1;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV2
  struct stm32_hrtim_eev_cfg_s eev2;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV3
  struct stm32_hrtim_eev_cfg_s eev3;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV4
  struct stm32_hrtim_eev_cfg_s eev4;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV5
  struct stm32_hrtim_eev_cfg_s eev5;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV6
  struct stm32_hrtim_eev_cfg_s eev6;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV7
  struct stm32_hrtim_eev_cfg_s eev7;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV8
  struct stm32_hrtim_eev_cfg_s eev8;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV9
  struct stm32_hrtim_eev_cfg_s eev9;
#endif
#ifdef CONFIG_STM32_HRTIM_EEV10
  struct stm32_hrtim_eev_cfg_s eev10;
#endif
};
#endif

#ifdef HRTIM_HAVE_ADC
/* Structure describes HRTIM ADC triggering configuration */

struct stm32_hrtim_adc_s
{
#ifdef HRTIM_HAVE_ADC_TRG1
  uint32_t trg1;
#endif
#ifdef HRTIM_HAVE_ADC_TRG2
  uint32_t trg2;
#endif
#ifdef HRTIM_HAVE_ADC_TRG3
  uint32_t trg3;
#endif
#ifdef HRTIM_HAVE_ADC_TRG4
  uint32_t trg4;
#endif
};
#endif

/* Structure describes HRTIM Burst mode configuratione */

#ifdef CONFIG_STM32_HRTIM_BURST
struct stm32_hrtim_burst_s
{
  uint8_t clk:4;                /* Burst mode clock source */
  uint8_t presc:4;              /* Prescaler for f_HRTIM clock */
  uint32_t trg;                 /* Burst mode triggers */
};
#endif

/* This structure describes the configuration of HRTIM device */

struct stm32_hrtim_s
{
  uint32_t base;                     /* Base address of HRTIM block */
  struct stm32_hrtim_tim_s *master;  /* Master Timer */
#ifdef CONFIG_STM32_HRTIM_TIMA
  struct stm32_hrtim_tim_s *tima;    /* HRTIM Timer A */
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB
  struct stm32_hrtim_tim_s *timb;    /* HRTIM Timer B */
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC
  struct stm32_hrtim_tim_s *timc;    /* HRTIM Timer C */
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD
  struct stm32_hrtim_tim_s *timd;    /* HRTIM Timer D */
#endif
#ifdef CONFIG_STM32_HRTIM_TIME
  struct stm32_hrtim_tim_s *time;    /* HRTIM Timer E */
#endif
#ifdef CONFIG_STM32_HRTIM_FAULTS
  struct stm32_hrtim_faults_s *flt;  /* Faults configuration */
#endif
#ifdef CONFIG_STM32_HRTIM_EVENTS
  struct stm32_hrtim_eev_s *eev;     /* External Events configuration  */
#endif
#ifdef HRTIM_HAVE_ADC
  struct stm32_hrtim_adc_s *adc;     /* ADC triggering configuration */
#endif
#ifdef CONFIG_STM32_HRTIM_BURST
  struct stm32_hrtim_burst_s *burst; /* Burst mode configuration */
#endif
#ifdef CONFIG_STM32_HRTIM_INTERRUPTS
  uint32_t irq;                      /* Common interrupts configuration */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifndef CONFIG_STM32_HRTIM_DISABLE_CHARDRV

/* HRTIM Driver Methods */

static int stm32_hrtim_open(struct file *filep);
static int stm32_hrtim_close(struct file *filep);
static int stm32_hrtim_ioctl(struct file *filep, int cmd,
                             unsigned long arg);
#endif

/* HRTIM Register access */

static uint32_t hrtim_cmn_getreg(struct stm32_hrtim_s *priv,
                                 uint32_t offset);
static void hrtim_cmn_putreg(struct stm32_hrtim_s *priv, uint32_t offset,
                             uint32_t value);
#ifdef CONFIG_STM32_HRTIM_BURST
static void hrtim_cmn_modifyreg(struct stm32_hrtim_s *priv,
                                uint32_t offset, uint32_t clrbits,
                                uint32_t setbits);
#endif
static void hrtim_tim_putreg(struct stm32_hrtim_s *priv, uint8_t timer,
                             uint32_t offset, uint32_t value);
static void hrtim_tim_modifyreg(struct stm32_hrtim_s *priv,
                                uint8_t timer, uint32_t offset,
                                uint32_t clrbits, uint32_t setbits);

#ifdef CONFIG_DEBUG_TIMER_INFO
static void hrtim_dumpregs(struct stm32_hrtim_s *priv, uint8_t timer,
                           const char *msg);
#else
#  define hrtim_dumpregs(priv, timer, msg)
#endif

/* HRTIM helper */

static uint32_t hrtim_tim_getreg(struct stm32_hrtim_s *priv,
                                 uint8_t timer, uint32_t offset);
static struct stm32_hrtim_tim_s *
  hrtim_tim_get(struct stm32_hrtim_s *priv,
                                                   uint8_t timer);
#if defined(CONFIG_STM32_HRTIM_PWM) || defined(CONFIG_STM32_HRTIM_FAULTS)
static struct stm32_hrtim_slave_priv_s *
         hrtim_slave_get(struct stm32_hrtim_s *priv, uint8_t timer);
#endif
static uint32_t hrtim_base_get(struct stm32_hrtim_s *priv,
                               uint8_t timer);

/* Configuration */

static int hrtim_dll_cal(struct stm32_hrtim_s *priv);
static int hrtim_tim_clock_config(struct stm32_hrtim_s *priv,
                                  uint8_t timer, uint8_t pre);
static int hrtim_tim_clocks_config(struct stm32_hrtim_s *priv);
#if defined(CONFIG_STM32_HRTIM_PWM) || defined(CONFIG_STM32_HRTIM_SYNC)
static int hrtim_gpios_config(struct stm32_hrtim_s *priv);
#endif
#if defined(CONFIG_STM32_HRTIM_CAPTURE)
static int hrtim_capture_config(struct stm32_hrtim_s *priv);
static uint16_t hrtim_capture_get(struct hrtim_dev_s *dev, uint8_t timer,
                                  uint8_t index);
static int hrtim_soft_capture(struct hrtim_dev_s *dev, uint8_t timer,
                              uint8_t index);
#endif
#if defined(CONFIG_STM32_HRTIM_SYNC)
static int hrtim_synch_config(struct stm32_hrtim_s *priv);
#endif
#if defined(CONFIG_STM32_HRTIM_PWM)
static int hrtim_outputs_config(struct stm32_hrtim_s *priv);
static int hrtim_outputs_enable(struct hrtim_dev_s *dev,
                                uint16_t outputs, bool state);
static int hrtim_output_set_set(struct hrtim_dev_s *dev, uint16_t output,
                                uint32_t set);
static int hrtim_output_rst_set(struct hrtim_dev_s *dev, uint16_t output,
                                 uint32_t rst);
#endif
#ifdef HRTIM_HAVE_ADC
static int hrtim_adc_config(struct stm32_hrtim_s *priv);
#endif
#ifdef CONFIG_STM32_HRTIM_DAC
static int hrtim_dac_config(struct stm32_hrtim_s *priv);
#endif
#ifdef CONFIG_STM32_HRTIM_DMA
static int hrtim_dma_cfg(struct stm32_hrtim_s *priv);
static int hrtim_tim_dma_cfg(struct stm32_hrtim_s *priv, uint8_t timer,
                             uint16_t dma);
#endif
#ifdef CONFIG_STM32_HRTIM_DEADTIME
static int hrtim_deadtime_update(struct hrtim_dev_s *dev, uint8_t timer,
                                 uint8_t dt, uint16_t value);
static uint16_t hrtim_deadtime_get(struct hrtim_dev_s *dev,
                                   uint8_t timer, uint8_t dt);
static int hrtim_tim_deadtime_cfg(struct stm32_hrtim_s *priv,
                                  uint8_t timer);
static int hrtim_deadtime_config(struct stm32_hrtim_s *priv);
#endif
#ifdef CONFIG_STM32_HRTIM_CHOPPER
static int hrtim_chopper_enable(struct hrtim_dev_s *dev, uint8_t timer,
                                uint8_t chan, bool state);
static int hrtim_tim_chopper_cfg(struct stm32_hrtim_s *priv,
                                 uint8_t timer);
static int hrtim_chopper_config(struct stm32_hrtim_s *priv);
#endif
#ifdef CONFIG_STM32_HRTIM_BURST
static int hrtim_burst_enable(struct hrtim_dev_s *dev, bool state);
static int hrtim_burst_cmp_update(struct hrtim_dev_s *dev, uint16_t cmp);
static int hrtim_burst_per_update(struct hrtim_dev_s *dev, uint16_t per);
static uint16_t hrtim_burst_cmp_get(struct hrtim_dev_s *dev);
static uint16_t hrtim_burst_per_get(struct hrtim_dev_s *dev);
static int hrtim_burst_pre_update(struct hrtim_dev_s *dev, uint8_t pre);
static int hrtim_burst_pre_get(struct hrtim_dev_s *dev);
static int hrtim_burst_config(struct stm32_hrtim_s *priv);
#endif
#ifdef CONFIG_STM32_HRTIM_FAULTS
static int hrtim_faults_config(struct stm32_hrtim_s *priv);
static int hrtim_flt_cfg(struct stm32_hrtim_s *priv, uint8_t index);
static int hrtim_tim_faults_cfg(struct stm32_hrtim_s *priv,
                                uint8_t timer);
#endif
#ifdef CONFIG_STM32_HRTIM_EVENTS
static int hrtim_events_config(struct stm32_hrtim_s *priv);
static int hrtim_eev_cfg(struct stm32_hrtim_s *priv, uint8_t index);
#endif
#ifdef CONFIG_STM32_HRTIM_INTERRUPTS
static int hrtim_irq_config(struct stm32_hrtim_s *priv);
static uint16_t hrtim_irq_get(struct hrtim_dev_s *dev, uint8_t timer);
static int hrtim_irq_ack(struct hrtim_dev_s *dev, uint8_t timer,
                         int source);
#endif
static int hrtim_cmp_update(struct hrtim_dev_s *dev, uint8_t timer,
                            uint8_t index, uint16_t cmp);
static int hrtim_per_update(struct hrtim_dev_s *dev, uint8_t timer,
                            uint16_t per);
static int hrtim_rep_update(struct hrtim_dev_s *dev, uint8_t timer,
                            uint8_t rep);
static uint16_t hrtim_per_get(struct hrtim_dev_s *dev, uint8_t timer);
static uint16_t hrtim_cmp_get(struct hrtim_dev_s *dev, uint8_t timer,
                              uint8_t index);
static uint64_t hrtim_fclk_get(struct hrtim_dev_s *dev, uint8_t timer);
static int hrtim_soft_update(struct hrtim_dev_s *dev, uint8_t timer);
static int hrtim_soft_reset(struct hrtim_dev_s *dev, uint8_t timer);
static int hrtim_tim_freq_set(struct hrtim_dev_s *dev, uint8_t timer,
                              uint64_t freq);
static int hrtim_tim_enable(struct hrtim_dev_s  *dev, uint8_t timers,
                            bool state);
static int hrtim_tim_reset_set(struct stm32_hrtim_s *priv,
                               uint8_t timer, uint64_t reset);
static int hrtim_reset_config(struct stm32_hrtim_s *priv);
static int hrtim_tim_update_set(struct stm32_hrtim_s *priv,
                                uint8_t timer,
                                uint16_t update);
static int hrtim_update_config(struct stm32_hrtim_s *priv);

static void hrtim_tim_mode_set(struct stm32_hrtim_s *priv, uint8_t timer,
                               uint8_t mode);
static void hrtim_mode_config(struct stm32_hrtim_s *priv);

/* Initialization */

static int stm32_hrtimconfig(struct stm32_hrtim_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifndef CONFIG_STM32_HRTIM_DISABLE_CHARDRV
static const struct file_operations g_hrtim_fops =
{
  stm32_hrtim_open,   /* open */
  stm32_hrtim_close,  /* close */
  NULL,               /* read */
  NULL,               /* write */
  NULL,               /* seek */
  stm32_hrtim_ioctl,  /* ioctl */
};
