apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
#endif /* CONFIG_STM32_HRTIM_DISABLE_CHARDRV */

/* Master Timer data */

static struct stm32_hrtim_tim_s g_master =
{
  .tim =
  {
    .base  = STM32_HRTIM1_MASTER_BASE,

    /* If MASTER is disabled, we need only MASTER base */

#ifdef CONFIG_STM32_HRTIM_MASTER
    .fclk      = HRTIM_CLOCK / (1 << HRTIM_MASTER_PRESCALER),
    .prescaler = HRTIM_MASTER_PRESCALER,
    .mode      = HRTIM_MASTER_MODE,
#  ifdef CONFIG_STM32_HRTIM_MASTER_DAC
    .dac       = HRTIM_MASTER_DAC,
#  endif
#  ifdef CONFIG_STM32_HRTIM_MASTER_IRQ
    .irq       = HRTIM_MASTER_IRQ
#  endif
#  ifdef CONFIG_STM32_HRTIM_MASTER_DMA
    .dma       = HRTIM_MASTER_DMA
#  endif
#endif
  },
  .priv        = NULL,
};

#ifdef CONFIG_STM32_HRTIM_TIMA

/* Timer A private data */

static struct stm32_hrtim_slave_priv_s g_tima_priv =
{
  .update = HRTIM_TIMA_UPDATE,
  .reset  = HRTIM_TIMA_RESET,
#ifdef CONFIG_STM32_HRTIM_TIMA_PWM
  .pwm =
  {
#ifdef CONFIG_STM32_HRTIM_TIMA_PSHPLL
    .pushpull = 1,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMA_PWM_CH1
    .ch1 =
    {
      .set = HRTIM_TIMA_CH1_SET,
      .rst = HRTIM_TIMA_CH1_RST,
      .pol = HRTIM_TIMA_CH1_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMA_PWM_CH2
    .ch2 =
    {
      .set = HRTIM_TIMA_CH2_SET,
      .rst = HRTIM_TIMA_CH2_RST,
      .pol = HRTIM_TIMA_CH2_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMA_BURST
    .burst =
    {
#  ifdef CONFIG_STM32_HRTIM_TIMA_BURST_CH1
      .ch1_en    = 1,
      .ch1_state = HRTIM_TIMA_CH1_IDLE_STATE,
#  else
      .ch1_en    = 0,
#  endif
#  ifdef CONFIG_STM32_HRTIM_TIMA_BURST_CH2
      .ch2_en    = 1,
      .ch2_state = HRTIM_TIMA_CH2_IDLE_STATE
#  else
      .ch2_en    = 0,
#  endif
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMA_CHOP
    .chp =
    {
      .start_pulse = HRTIM_TIMA_CHOP_START,
      .duty        = HRTIM_TIMA_CHOP_DUTY,
      .freq        = HRTIM_TIMA_CHOP_FREQ
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMA_DT
    .dt =
    {
      .en           = 1,
      .fsign_lock   = HRTIM_TIMA_DT_FSLOCK,
      .rsign_lock   = HRTIM_TIMA_DT_RSLOCK,
      .falling_lock = HRTIM_TIMA_DT_FVLOCK,
      .rising_lock  = HRTIM_TIMA_DT_RVLOCK,
      .fsign        = HRTIM_TIMA_DT_FSIGN,
      .rsign        = HRTIM_TIMA_DT_RSIGN,
      .prescaler    = HRTIM_TIMA_DT_PRESCALER
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMA_CAP
  .cap =
  {
    .cap1 = HRTIM_TIMA_CAPTURE1,
    .cap2 = HRTIM_TIMA_CAPTURE2,
  }
#endif
};

/* Timer A data */

static struct stm32_hrtim_tim_s g_tima =
{
  .tim =
  {
    .base      = STM32_HRTIM1_TIMERA_BASE,
    .fclk      = HRTIM_CLOCK / (1 << HRTIM_TIMA_PRESCALER),
    .prescaler = HRTIM_TIMA_PRESCALER,
    .mode      = HRTIM_TIMA_MODE,
#ifdef CONFIG_STM32_HRTIM_TIMA_DAC
    .dac       = HRTIM_TIMA_DAC,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMA_IRQ
    .irq       = HRTIM_TIMA_IRQ,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMA_DMA
    .dma       = HRTIM_TIMA_DMA
#endif
  },
  .priv        = &g_tima_priv
};
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB
/* Timer B private data */

static struct stm32_hrtim_slave_priv_s g_timb_priv =
{
  .update = HRTIM_TIMB_UPDATE,
  .reset  = HRTIM_TIMB_RESET,
#ifdef CONFIG_STM32_HRTIM_TIMB_PWM
  .pwm =
  {
#ifdef CONFIG_STM32_HRTIM_TIMB_PSHPLL
    .pushpull = 1,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB_PWM_CH1
    .ch1 =
    {
      .set = HRTIM_TIMB_CH1_SET,
      .rst = HRTIM_TIMB_CH1_RST,
      .pol = HRTIM_TIMB_CH1_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB_PWM_CH2
    .ch2 =
    {
      .set = HRTIM_TIMB_CH2_SET,
      .rst = HRTIM_TIMB_CH2_RST,
      .pol = HRTIM_TIMB_CH2_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB_BURST
    .burst =
    {
#  ifdef CONFIG_STM32_HRTIM_TIMB_BURST_CH1
      .ch1_en    = 1,
      .ch1_state = HRTIM_TIMB_CH1_IDLE_STATE,
#  else
      .ch1_en    = 0,
#  endif
#  ifdef CONFIG_STM32_HRTIM_TIMB_BURST_CH2
      .ch2_en    = 1,
      .ch2_state = HRTIM_TIMB_CH2_IDLE_STATE
#  else
      .ch2_en    = 0,
#  endif
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB_CHOP
    .chp =
    {
      .start_pulse = HRTIM_TIMB_CHOP_START,
      .duty        = HRTIM_TIMB_CHOP_DUTY,
      .freq        = HRTIM_TIMB_CHOP_FREQ
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB_DT
    .dt =
    {
      .en           = 1,
      .fsign_lock   = HRTIM_TIMB_DT_FSLOCK,
      .rsign_lock   = HRTIM_TIMB_DT_RSLOCK,
      .falling_lock = HRTIM_TIMB_DT_FVLOCK,
      .rising_lock  = HRTIM_TIMB_DT_RVLOCK,
      .fsign        = HRTIM_TIMB_DT_FSIGN,
      .rsign        = HRTIM_TIMB_DT_RSIGN,
      .prescaler    = HRTIM_TIMB_DT_PRESCALER
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB_CAP
  .cap =
  {
    .cap1 = HRTIM_TIMB_CAPTURE1,
    .cap2 = HRTIM_TIMB_CAPTURE2,
  }
#endif
};

/* Timer B data */

static struct stm32_hrtim_tim_s g_timb =
{
  .tim =
  {
    .base      = STM32_HRTIM1_TIMERB_BASE,
    .fclk      = HRTIM_CLOCK / (1 << HRTIM_TIMB_PRESCALER),
    .prescaler = HRTIM_TIMB_PRESCALER,
    .mode      = HRTIM_TIMB_MODE,
#ifdef CONFIG_STM32_HRTIM_TIMB_DAC
    .dac       = HRTIM_TIMB_DAC,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB_IRQ
    .irq       = HRTIM_TIMB_IRQ,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB_DMA
    .dma       = HRTIM_TIMB_DMA
#endif
  },
  .priv        = &g_timb_priv
};
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC
/* Timer C private data */

static struct stm32_hrtim_slave_priv_s g_timc_priv =
{
  .update = HRTIM_TIMC_UPDATE,
  .reset  = HRTIM_TIMC_RESET,
#ifdef CONFIG_STM32_HRTIM_TIMC_PWM
  .pwm =
  {
#ifdef CONFIG_STM32_HRTIM_TIMC_PSHPLL
    .pushpull = 1,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC_PWM_CH1
    .ch1 =
    {
      .set = HRTIM_TIMC_CH1_SET,
      .rst = HRTIM_TIMC_CH1_RST,
      .pol = HRTIM_TIMC_CH1_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC_PWM_CH2
    .ch2 =
    {
      .set = HRTIM_TIMC_CH2_SET,
      .rst = HRTIM_TIMC_CH2_RST,
      .pol = HRTIM_TIMC_CH2_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC_BURST
    .burst =
    {
#  ifdef CONFIG_STM32_HRTIM_TIMC_BURST_CH1
      .ch1_en    = 1,
      .ch1_state = HRTIM_TIMC_CH1_IDLE_STATE,
#  else
      .ch1_en    = 0,
#  endif
#  ifdef CONFIG_STM32_HRTIM_TIMC_BURST_CH2
      .ch2_en    = 1,
      .ch2_state = HRTIM_TIMC_CH2_IDLE_STATE
#  else
      .ch2_en    = 0,
#  endif
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC_CHOP
    .chp =
    {
      .start_pulse = HRTIM_TIMC_CHOP_START,
      .duty        = HRTIM_TIMC_CHOP_DUTY,
      .freq        = HRTIM_TIMC_CHOP_FREQ
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC_DT
    .dt =
    {
      .en           = 1,
      .fsign_lock   = HRTIM_TIMC_DT_FSLOCK,
      .rsign_lock   = HRTIM_TIMC_DT_RSLOCK,
      .falling_lock = HRTIM_TIMC_DT_FVLOCK,
      .rising_lock  = HRTIM_TIMC_DT_RVLOCK,
      .fsign        = HRTIM_TIMC_DT_FSIGN,
      .rsign        = HRTIM_TIMC_DT_RSIGN,
      .prescaler    = HRTIM_TIMC_DT_PRESCALER
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC_CAP
  .cap =
  {
    .cap1 = HRTIM_TIMC_CAPTURE1,
    .cap2 = HRTIM_TIMC_CAPTURE2,
  }
#endif
};

