apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
/* Timer C data */

static struct stm32_hrtim_tim_s g_timc =
{
  .tim =
  {
    .base      = STM32_HRTIM1_TIMERC_BASE,
    .fclk      = HRTIM_CLOCK / (1 << HRTIM_TIMC_PRESCALER),
    .prescaler = HRTIM_TIMC_PRESCALER,
    .mode      = HRTIM_TIMC_MODE,
#ifdef CONFIG_STM32_HRTIM_TIMC_DAC
    .dac       = HRTIM_TIMC_DAC,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC_IRQ
    .irq       = HRTIM_TIMC_IRQ,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC_DMA
    .dma       = HRTIM_TIMC_DMA
#endif
  },
  .priv        = &g_timc_priv
};
#endif

#ifdef CONFIG_STM32_HRTIM_TIMD
/* Timer D private data */

static struct stm32_hrtim_slave_priv_s g_timd_priv =
{
  .update = HRTIM_TIMD_UPDATE,
  .reset  = HRTIM_TIMD_RESET,
#ifdef CONFIG_STM32_HRTIM_TIMD_PWM
  .pwm =
  {
#ifdef CONFIG_STM32_HRTIM_TIMD_PSHPLL
    .pushpull = 1,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD_PWM_CH1
    .ch1 =
    {
      .set = HRTIM_TIMD_CH1_SET,
      .rst = HRTIM_TIMD_CH1_RST,
      .pol = HRTIM_TIMD_CH1_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD_PWM_CH2
    .ch2 =
    {
      .set = HRTIM_TIMD_CH2_SET,
      .rst = HRTIM_TIMD_CH2_RST,
      .pol = HRTIM_TIMD_CH2_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD_BURST
    .burst =
    {
#  ifdef CONFIG_STM32_HRTIM_TIMD_BURST_CH1
      .ch1_en    = 1,
      .ch1_state = HRTIM_TIMD_CH1_IDLE_STATE,
#  else
      .ch1_en    = 0,
#  endif
#  ifdef CONFIG_STM32_HRTIM_TIMD_BURST_CH2
      .ch2_en    = 1,
      .ch2_state = HRTIM_TIMD_CH2_IDLE_STATE
#  else
      .ch2_en    = 0,
#  endif
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD_CHOP
    .chp =
    {
      .start_pulse = HRTIM_TIMD_CHOP_START,
      .duty        = HRTIM_TIMD_CHOP_DUTY,
      .freq        = HRTIM_TIMD_CHOP_FREQ
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD_DT
    .dt =
    {
      .en           = 1,
      .fsign_lock   = HRTIM_TIMD_DT_FSLOCK,
      .rsign_lock   = HRTIM_TIMD_DT_RSLOCK,
      .falling_lock = HRTIM_TIMD_DT_FVLOCK,
      .rising_lock  = HRTIM_TIMD_DT_RVLOCK,
      .fsign        = HRTIM_TIMD_DT_FSIGN,
      .rsign        = HRTIM_TIMD_DT_RSIGN,
      .prescaler    = HRTIM_TIMD_DT_PRESCALER
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD_CAP
  .cap =
  {
    .cap1 = HRTIM_TIMD_CAPTURE1,
    .cap2 = HRTIM_TIMD_CAPTURE2,
  }
#endif
};

/* Timer D data */

static struct stm32_hrtim_tim_s g_timd =
{
  .tim =
  {
    .base      = STM32_HRTIM1_TIMERD_BASE,
    .fclk      = HRTIM_CLOCK / (1 << HRTIM_TIMD_PRESCALER),
    .prescaler = HRTIM_TIMD_PRESCALER,
    .mode      = HRTIM_TIMD_MODE,
#ifdef CONFIG_STM32_HRTIM_TIMD_DAC
    .dac       = HRTIM_TIMD_DAC,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD_IRQ
    .irq       = HRTIM_TIMD_IRQ,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD_DMA
    .dma       = HRTIM_TIMD_DMA
#endif
  },
  .priv        = &g_timd_priv
};
#endif

#ifdef CONFIG_STM32_HRTIM_TIME
/* Timer E private data */

static struct stm32_hrtim_slave_priv_s g_time_priv =
{
  .update = HRTIM_TIME_UPDATE,
  .reset  = HRTIM_TIME_RESET,
#ifdef CONFIG_STM32_HRTIM_TIME_PWM
  .pwm =
  {
#ifdef CONFIG_STM32_HRTIM_TIME_PSHPLL
    .pushpull = 1,
#endif
#ifdef CONFIG_STM32_HRTIM_TIME_PWM_CH1
    .ch1 =
    {
      .set = HRTIM_TIME_CH1_SET,
      .rst = HRTIM_TIME_CH1_RST,
      .pol = HRTIM_TIME_CH1_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIME_PWM_CH2
    .ch2 =
    {
      .set = HRTIM_TIME_CH2_SET,
      .rst = HRTIM_TIME_CH2_RST,
      .pol = HRTIM_TIME_CH1_POL
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIME_BURST
    .burst =
    {
#  ifdef CONFIG_STM32_HRTIM_TIME_BURST_CH1
      .ch1_en    = 1,
      .ch1_state = HRTIM_TIME_CH1_IDLE_STATE,
#  else
      .ch1_en    = 0,
#  endif
#  ifdef CONFIG_STM32_HRTIM_TIME_BURST_CH2
      .ch2_en    = 1,
      .ch2_state = HRTIM_TIME_CH2_IDLE_STATE
#  else
      .ch2_en    = 0,
#  endif
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIME_CHOP
    .chp =
    {
      .start_pulse = HRTIM_TIME_CHOP_START,
      .duty        = HRTIM_TIME_CHOP_DUTY,
      .freq        = HRTIM_TIME_CHOP_FREQ
    },
#endif
#ifdef CONFIG_STM32_HRTIM_TIME_DT
    .dt =
    {
      .en           = 1,
      .fsign_lock   = HRTIM_TIME_DT_FSLOCK,
      .rsign_lock   = HRTIM_TIME_DT_RSLOCK,
      .falling_lock = HRTIM_TIME_DT_FVLOCK,
      .rising_lock  = HRTIM_TIME_DT_RVLOCK,
      .fsign        = HRTIM_TIME_DT_FSIGN,
      .rsign        = HRTIM_TIME_DT_RSIGN,
      .prescaler    = HRTIM_TIME_DT_PRESCALER
    }
#endif
  },
#endif
#ifdef CONFIG_STM32_HRTIM_TIME_CAP
  .cap =
  {
    .cap1 = HRTIM_TIME_CAPTURE1,
    .cap2 = HRTIM_TIME_CAPTURE2,
  }
#endif
};

/* Timer E data */

static struct stm32_hrtim_tim_s g_time =
{
  .tim =
  {
    .base      = STM32_HRTIM1_TIMERE_BASE,
    .fclk      = HRTIM_CLOCK / (1 << HRTIM_TIME_PRESCALER),
    .prescaler = HRTIM_TIME_PRESCALER,
    .mode      = HRTIM_TIME_MODE,
#ifdef CONFIG_STM32_HRTIM_TIME_DAC
    .dac       = HRTIM_TIME_DAC,
#endif
#ifdef CONFIG_STM32_HRTIM_TIME_IRQ
    .irq       = HRTIM_TIME_IRQ,
#endif
#ifdef CONFIG_STM32_HRTIM_TIME_DMA
    .dma       = HRTIM_TIME_DMA
#endif
  },
  .priv        = &g_time_priv
};
#endif

/* Faults data */

#ifdef CONFIG_STM32_HRTIM_FAULTS
struct stm32_hrtim_faults_s g_flt =
{
#ifdef CONFIG_STM32_HRTIM_FAULT1
  .flt1 =
  {
    .pol    = HRTIM_FAULT1_POL,
    .src    = HRTIM_FAULT1_SRC,
    .filter = HRTIM_FAULT1_FILTER,
    .lock   = HRTIM_FAULT1_LOCK,
  },
#endif
#ifdef CONFIG_STM32_HRTIM_FAULT2
  .flt2 =
  {
    .pol    = HRTIM_FAULT2_POL,
    .src    = HRTIM_FAULT2_SRC,
    .filter = HRTIM_FAULT2_FILTER,
    .lock   = HRTIM_FAULT2_LOCK,
  },
#endif
#ifdef CONFIG_STM32_HRTIM_FAULT3
  .flt3 =
  {
    .pol    = HRTIM_FAULT3_POL,
    .src    = HRTIM_FAULT3_SRC,
    .filter = HRTIM_FAULT3_FILTER,
    .lock   = HRTIM_FAULT3_LOCK,
  },
#endif
#ifdef CONFIG_STM32_HRTIM_FAULT4
  .flt2 =
  {
    .pol    = HRTIM_FAULT4_POL,
    .src    = HRTIM_FAULT4_SRC,
    .filter = HRTIM_FAULT4_FILTER,
    .lock   = HRTIM_FAULT4_LOCK,
  },
#endif
#ifdef CONFIG_STM32_HRTIM_FAULT5
  .flt2 =
  {
    .pol    = HRTIM_FAULT5_POL,
    .src    = HRTIM_FAULT5_SRC,
    .filter = HRTIM_FAULT5_FILTER,
    .lock   = HRTIM_FAULT5_LOCK,
  },
#endif
};
#endif

/* External Events data */

#ifdef CONFIG_STM32_HRTIM_EVENTS
struct stm32_hrtim_eev_s g_eev =
{
#ifdef CONFIG_STM32_HRTIM_EEV1
  .eev1 =
  {
    .filter = HRTIM_EEV1_FILTER,
    .src    = HRTIM_EEV1_SRC,
    .pol    = HRTIM_EEV1_POL,
    .sen    = HRTIM_EEV1_SEN,
    .mode   = HRTIM_EEV1_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV2
  .eev2 =
  {
    .filter = HRTIM_EEV2_FILTER,
    .src    = HRTIM_EEV2_SRC,
    .pol    = HRTIM_EEV2_POL,
    .sen    = HRTIM_EEV2_SEN,
    .mode   = HRTIM_EEV2_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV3
  .eev3 =
  {
    .filter = HRTIM_EEV3_FILTER,
    .src    = HRTIM_EEV3_SRC,
    .pol    = HRTIM_EEV3_POL,
    .sen    = HRTIM_EEV3_SEN,
    .mode   = HRTIM_EEV3_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV4
  .eev4 =
  {
    .filter = HRTIM_EEV4_FILTER,
    .src    = HRTIM_EEV4_SRC,
    .pol    = HRTIM_EEV4_POL,
    .sen    = HRTIM_EEV4_SEN,
    .mode   = HRTIM_EEV4_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV5
  .eev5 =
  {
    .filter = HRTIM_EEV5_FILTER,
    .src    = HRTIM_EEV5_SRC,
    .pol    = HRTIM_EEV5_POL,
    .sen    = HRTIM_EEV5_SEN,
    .mode   = HRTIM_EEV5_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV6
  .eev6 =
  {
    .filter = HRTIM_EEV6_FILTER,
    .src    = HRTIM_EEV6_SRC,
    .pol    = HRTIM_EEV6_POL,
    .sen    = HRTIM_EEV6_SEN,
    .mode   = HRTIM_EEV6_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV7
  .eev7 =
  {
    .filter = HRTIM_EEV7_FILTER,
    .src    = HRTIM_EEV7_SRC,
    .pol    = HRTIM_EEV7_POL,
    .sen    = HRTIM_EEV7_SEN,
    .mode   = HRTIM_EEV7_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV8
  .eev8 =
  {
    .filter = HRTIM_EEV8_FILTER,
    .src    = HRTIM_EEV8_SRC,
    .pol    = HRTIM_EEV8_POL,
    .sen    = HRTIM_EEV8_SEN,
    .mode   = HRTIM_EEV8_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV9
  .eev9 =
  {
    .filter = HRTIM_EEV9_FILTER,
    .src    = HRTIM_EEV9_SRC,
    .pol    = HRTIM_EEV9_POL,
    .sen    = HRTIM_EEV9_SEN,
    .mode   = HRTIM_EEV9_MODE,
  }
#endif
#ifdef CONFIG_STM32_HRTIM_EEV10
  .eev10 =
  {
    .filter = HRTIM_EEV10_FILTER,
    .src    = HRTIM_EEV10_SRC,
    .pol    = HRTIM_EEV10_POL,
    .sen    = HRTIM_EEV10_SEN,
    .mode   = HRTIM_EEV10_MODE,
  }
#endif
};
#endif

/* ADC triggering data */

#ifdef HRTIM_HAVE_ADC
struct stm32_hrtim_adc_s g_adc =
{
#ifdef HRTIM_HAVE_ADC_TRG1
  .trg1 = HRTIM_ADC_TRG1,
#endif
#ifdef HRTIM_HAVE_ADC_TRG2
  .trg2 = HRTIM_ADC_TRG2,
#endif
#ifdef HRTIM_HAVE_ADC_TRG3
  .trg3 = HRTIM_ADC_TRG3,
#endif
#ifdef HRTIM_HAVE_ADC_TRG4
  .trg4 = HRTIM_ADC_TRG4
#endif
};
#endif

/* Burst mode data */

#ifdef CONFIG_STM32_HRTIM_BURST
struct stm32_hrtim_burst_s g_burst =
{
  .clk   = HRTIM_BURST_CLOCK,
  .presc = HRTIM_BURST_PRESCALER,
  .trg   = HRTIM_BURST_TRIGGERS
};
#endif

/* HRTIM1 private data */

static struct stm32_hrtim_s g_hrtim1priv =
{
  .master   = &g_master,
  .base     = STM32_HRTIM1_BASE,
#ifdef CONFIG_STM32_HRTIM_TIMA
  .tima     = &g_tima,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB
  .timb     = &g_timb,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC
  .timc     = &g_timc,
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD
  .timd     = &g_timd,
#endif
#ifdef CONFIG_STM32_HRTIM_TIME
  .time     = &g_time,
#endif
#ifdef CONFIG_STM32_HRTIM_FAULTS
  .flt      = &g_flt,
#endif
#ifdef CONFIG_STM32_HRTIM_EVENTS
  .eev      = &g_eev,
#endif
#ifdef HRTIM_HAVE_ADC
  .adc      = &g_adc,
#endif
#ifdef CONFIG_STM32_HRTIM_BURST
  .burst      = &g_burst,
#endif
#ifdef CONFIG_STM32_HRTIM_COMMON_IRQ
  .irq      = HRTIM_IRQ_COMMON,
#endif
};

/* HRTIM interface */

static const struct stm32_hrtim_ops_s g_hrtim1ops =
{
  .cmp_update     = hrtim_cmp_update,
  .per_update     = hrtim_per_update,
  .rep_update     = hrtim_rep_update,
  .per_get        = hrtim_per_get,
  .cmp_get        = hrtim_cmp_get,
  .fclk_get       = hrtim_fclk_get,
  .soft_update    = hrtim_soft_update,
  .soft_reset     = hrtim_soft_reset,
  .freq_set       = hrtim_tim_freq_set,
  .tim_enable     = hrtim_tim_enable,
#ifdef CONFIG_STM32_HRTIM_INTERRUPTS
  .irq_ack        = hrtim_irq_ack,
  .irq_get        = hrtim_irq_get,
#endif
#ifdef CONFIG_STM32_HRTIM_PWM
  .outputs_enable = hrtim_outputs_enable,
  .output_rst_set = hrtim_output_rst_set,
  .output_set_set = hrtim_output_set_set,
#endif
#ifdef CONFIG_STM32_HRTIM_BURST
  .burst_enable  = hrtim_burst_enable,
  .burst_cmp_set = hrtim_burst_cmp_update,
  .burst_per_set = hrtim_burst_per_update,
  .burst_pre_set = hrtim_burst_pre_update,
  .burst_cmp_get = hrtim_burst_cmp_get,
  .burst_per_get = hrtim_burst_per_get,
  .burst_pre_get = hrtim_burst_pre_get,
#endif
#ifdef CONFIG_STM32_HRTIM_CHOPPER
  .chopper_enable = hrtim_chopper_enable,
#endif
#ifdef CONFIG_STM32_HRTIM_DEADTIME
  .deadtime_update = hrtim_deadtime_update,
  .deadtime_get    = hrtim_deadtime_get,
#endif
#ifdef CONFIG_STM32_HRTIM_CAPTURE
  .capture_get   = hrtim_capture_get,
  .soft_capture  = hrtim_soft_capture,
#endif
};

/* HRTIM device structure */

struct hrtim_dev_s g_hrtim1dev =
{
  .hd_ops   = &g_hrtim1ops,
  .hd_priv  = &g_hrtim1priv,
  .initialized = false,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifndef CONFIG_STM32_HRTIM_DISABLE_CHARDRV

/****************************************************************************
 * Name: stm32_hrtim_open
 *
 * Description:
 *   This function is called whenever the HRTIM device is opened.
 *
 ****************************************************************************/

static int stm32_hrtim_open(struct file *filep)
{
#warning "stm32_hrtim_open: missing logic"
  return OK;
}

/****************************************************************************
 * Name: stm32_hrtim_close
 *
 * Description:
 *   This function is called when the HRTIM device is closed.
 *
 ****************************************************************************/

static int stm32_hrtim_close(struct file *filep)
{
#warning "smt32_hrtim_close: missing logic"
  return OK;
}

/****************************************************************************
 * Name: stm32_hrtim_ioctl
 *
 * Description:
 *   The standard ioctl method.  This is where ALL of the HRTIM work is done.
 *
 ****************************************************************************/

static int stm32_hrtim_ioctl(struct file *filep, int cmd,
                             unsigned long arg)
{
  struct inode *inode = filep->f_inode;
  struct hrtim_dev_s  *dev;
  struct stm32_hrtim_s *hrtim;
  int ret;

