apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
static void hrtim_tim_modifyreg(struct stm32_hrtim_s *priv,
                                uint8_t timer, uint32_t offset,
                                uint32_t clrbits, uint32_t setbits)
{
  hrtim_tim_putreg(priv, timer, offset,
                   (hrtim_tim_getreg(priv, timer, offset) & ~clrbits) |
                   setbits);
}

#ifdef CONFIG_DEBUG_TIMER_INFO
static void hrtim_dumpregs(struct stm32_hrtim_s *priv, uint8_t timer,
                           const char *msg)
{
  tmrinfo("%s:\n", msg);

  switch (timer)
    {
      case HRTIM_TIMER_MASTER:
        {
          tmrinfo("\tCR:\t0x%08" PRIx32 "\tISR:\t0x%08" PRIx32
                  "\tICR:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_ISR_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_ICR_OFFSET));

          tmrinfo("\tDIER:\t0x%08" PRIx32 "\tCNTR:\t0x%08" PRIx32
                  "\tPER:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_DIER_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CNTR_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_PER_OFFSET));

          tmrinfo("\tREP:\t0x%08" PRIx32 "\tCMP1:\t0x%08" PRIx32
                  "\tCMP2:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_REPR_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP1R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP2R_OFFSET));

          tmrinfo("\tCMP3:\t0x%08" PRIx32 "\tCMP4:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP3R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP4R_OFFSET));
          break;
        }

#ifdef CONFIG_STM32_HRTIM_TIMA
      case HRTIM_TIMER_TIMA:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB
      case HRTIM_TIMER_TIMB:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC
      case HRTIM_TIMER_TIMC:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD
      case HRTIM_TIMER_TIMD:
#endif
#ifdef CONFIG_STM32_HRTIM_TIME
      case HRTIM_TIMER_TIME:
#endif
        {
          tmrinfo("\tCR:\t0x%08" PRIx32 "\tISR:\t0x%08" PRIx32
                  "\tICR:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_ISR_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_ICR_OFFSET));

          tmrinfo("\tDIER:\t0x%08" PRIx32 "\tCNTR:\t0x%08" PRIx32
                  "\tPER:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_DIER_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CNTR_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_PER_OFFSET));

          tmrinfo("\tREP:\t0x%08" PRIx32 "\tCMP1:\t0x%08" PRIx32
                  "\tCMP1C:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_REPR_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP1R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP1CR_OFFSET));

          tmrinfo("\tCMP2:\t0x%08" PRIx32 "\tCMP3:\t0x%08" PRIx32
                  "\tCMP4:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP2R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP3R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CMP4R_OFFSET));

          tmrinfo("\tCPT1:\t0x%08" PRIx32 "\tCPT2:\t0x%08" PRIx32
                  "\tDTR:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CPT1R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CPT2R_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_DTR_OFFSET));

          tmrinfo("\tSET1:\t0x%08" PRIx32 "\tRST1:\t0x%08" PRIx32
                  "\tSET2:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_SET1R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_RST1R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_SET2R_OFFSET));

          tmrinfo("\tRST2:\t0x%08" PRIx32 "\tEEF1:\t0x%08" PRIx32
                  "\tEEF2:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_RST2R_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_EEFR1_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_EEFR2_OFFSET));

          tmrinfo("\tRSTR:\t0x%08" PRIx32 "\tCHPR:\t0x%08" PRIx32
                  "\tCPT1C:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_RSTR_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CHPR_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CPT1CR_OFFSET));

          tmrinfo("\tCPT2C:\t0x%08" PRIx32 "\tOUT:\t0x%08" PRIx32
                  "\tFLT:\t0x%08" PRIx32 "\n",
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_CPT2CR_OFFSET),
                  hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_OUTR_OFFSET),
                  hrtim_tim_getreg(priv, timer,
                                   STM32_HRTIM_TIM_FLTR_OFFSET));

          break;
        }

      case HRTIM_TIMER_COMMON:
        {
          tmrinfo("\tCR1:\t0x%08" PRIx32 "\tCR2:\t0x%08" PRIx32
                  "\tISR:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_CR1_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_CR2_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ISR_OFFSET));

          tmrinfo("\tICR:\t0x%08" PRIx32 "\tIER:\t0x%08" PRIx32
                  "\tOENR:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ICR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_IER_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_OENR_OFFSET));

