apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
          tmrinfo("\tODISR:\t0x%08" PRIx32 "\tODSR:\t0x%08" PRIx32
                  "\tBMCR:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ODISR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ODSR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BMCR_OFFSET));

          tmrinfo("\tBMTRG:\t0x%08" PRIx32 "\tBMCMPR:\t0x%08" PRIx32
                  "\tBMPER:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BMTRGR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BMCMPR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BMPER_OFFSET));

          tmrinfo("\tADC1R:\t0x%08" PRIx32 "\tADC2R:\t0x%08" PRIx32
                  "\tADC3R:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ADC1R_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ADC2R_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ADC3R_OFFSET));

          tmrinfo("\tADC4R:\t0x%08" PRIx32 "\tDLLCR:\t0x%08" PRIx32
                  "\tFLTIN1:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ADC4R_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_DLLCR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_FLTINR1_OFFSET));

          tmrinfo("\tFLTIN2:\t0x%08" PRIx32 "\tBDMUPD:\t0x%08" PRIx32
                  "\tBDTAUP:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_FLTINR2_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BDMUPDR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BDTAUPR_OFFSET));

          tmrinfo("\tBDTBUP: 0x%08" PRIx32 "\tBDTCUP:\t0x%08" PRIx32
                  "\tBDTDUP:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BDTBUPR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BDTCUPR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BDTDUPR_OFFSET));

          tmrinfo("\tBDTEUP:\t0x%08" PRIx32 "\tBDMAD:\t0x%08" PRIx32 "\n",
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BDTEUPR_OFFSET),
                  hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BDMADR_OFFSET));

          break;
        }

      default:
        {
          tmrerr("ERROR: No such timer index: %d\n", timer);
          break;
        }
    }
}
#endif

/****************************************************************************
 * Name: hrtim_dll_cal
 *
 * Description:
 *   Calibrate HRTIM DLL
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_dll_cal(struct stm32_hrtim_s *priv)
{
  uint32_t regval = 0;

#ifdef CONFIG_STM32_HRTIM_PERIODIC_CAL
  /* Configure calibration rate */

  regval |= HRTIM_DLLCR_CAL_RATE;

  /* Enable Periodic calibration */

  regval |= HRTIM_DLLCR_CALEN;

  /* CALEN must not be set simultaneously with CAL bit */

  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_DLLCR_OFFSET, regval);
#endif

  /* DLL Calibration Start */

  regval |= HRTIM_DLLCR_CAL;

  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_DLLCR_OFFSET, regval);

  while ((hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ISR_OFFSET) &
          HRTIM_ISR_DLLRDY) == 0);

  return OK;
}

/****************************************************************************
 * Name: hrtim_tim_clock_config
 *
 * Description:
 *   Configure HRTIM Timer clock
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *   timer  - An HRTIM Timer index
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_tim_clock_config(struct stm32_hrtim_s *priv,
                                  uint8_t timer, uint8_t pre)
{
  int ret = OK;
  uint32_t regval = 0;

  regval = hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET);

  switch (pre)
    {
      case HRTIM_PRESCALER_1:
        {
          regval |= HRTIM_CMNCR_CKPSC_NODIV;
          break;
        }

      case HRTIM_PRESCALER_2:
        {
          regval |= HRTIM_CMNCR_CKPSC_d2;
          break;
        }

      case HRTIM_PRESCALER_4:
        {
          regval |= HRTIM_CMNCR_CKPSC_d4;
          break;
        }

      case HRTIM_PRESCALER_8:
        {
          regval |= HRTIM_CMNCR_CKPSC_d8;
          break;
        }

      case HRTIM_PRESCALER_16:
        {
          regval |= HRTIM_CMNCR_CKPSC_d16;
          break;
        }

      case HRTIM_PRESCALER_32:
        {
          regval |= HRTIM_CMNCR_CKPSC_d32;
          break;
        }

      case HRTIM_PRESCALER_64:
        {
          regval |= HRTIM_CMNCR_CKPSC_d64;
          break;
        }

      case HRTIM_PRESCALER_128:
        {
          regval |= HRTIM_CMNCR_CKPSC_d128;
          break;
        }

      default:
        {
          tmrerr("ERROR: invalid prescaler value %d for timer %d\n", timer,
                   pre);
          ret = -EINVAL;
          goto errout;
        }
    }

  /* Write prescaler configuration */

  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET, regval);

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_tim_clocks_config
 *
 * Description:
 *   Configure HRTIM Timers Clocks
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_tim_clocks_config(struct stm32_hrtim_s *priv)
{
  int ret = OK;

  /* Configure Master Timer clock */

#ifdef CONFIG_STM32_HRTIM_MASTER
  ret = hrtim_tim_clock_config(priv, HRTIM_TIMER_MASTER,
                               HRTIM_MASTER_PRESCALER);
  if (ret < 0)
    {
      goto errout;
    }
#endif

  /* Configure Timer A clock */

#ifdef CONFIG_STM32_HRTIM_TIMA
  ret = hrtim_tim_clock_config(priv, HRTIM_TIMER_TIMA, HRTIM_TIMA_PRESCALER);
  if (ret < 0)
    {
      goto errout;
    }
#endif

  /* Configure Timer B clock */

#ifdef CONFIG_STM32_HRTIM_TIMB
  ret = hrtim_tim_clock_config(priv, HRTIM_TIMER_TIMB, HRTIM_TIMB_PRESCALER);
  if (ret < 0)
    {
      goto errout;
    }
#endif

