apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
static int hrtim_capture_config(struct stm32_hrtim_s *priv)
{
  struct stm32_hrtim_slave_priv_s *slave;

#ifdef CONFIG_STM32_HRTIM_TIMA_CAP
  slave = (struct stm32_hrtim_slave_priv_s *)priv->tima->priv;
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIMA, HRTIM_CAPTURE1,
                        slave->cap.cap1);
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIMA, HRTIM_CAPTURE2,
                        slave->cap.cap2);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB_CAP
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timb->priv;
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIMB, HRTIM_CAPTURE1,
                        slave->cap.cap1);
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIMB, HRTIM_CAPTURE2,
                        slave->cap.cap2);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC_CAP
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timc->priv;
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIMC, HRTIM_CAPTURE1,
                        slave->cap.cap1);
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIMC, HRTIM_CAPTURE2,
                        slave->cap.cap2);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMD_CAP
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timd->priv;
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIMD, HRTIM_CAPTURE1,
                        slave->cap.cap1);
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIMD, HRTIM_CAPTURE2,
                        slave->cap.cap2);
#endif

#ifdef CONFIG_STM32_HRTIM_TIME_CAP
  slave = (struct stm32_hrtim_slave_priv_s *)priv->time->priv;
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIME, HRTIM_CAPTURE1,
                        slave->cap.cap1);
  hrtim_tim_capture_cfg(priv, HRTIM_TIMER_TIME, HRTIM_CAPTURE2,
                        slave->cap.cap2);
#endif

  return OK;
}

/****************************************************************************
 * Name: hrtim_capture_get
 *
 * Description:
 *  Get HRTIM Timer Capture register
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM block
 *   timer  - HRTIM Timer index
 *   index  - Capture register index
 *
 * Returned Value:
 *   Timer Capture value on success, 0 on failure
 *
 ****************************************************************************/

static uint16_t hrtim_capture_get(struct hrtim_dev_s *dev, uint8_t timer,
                                  uint8_t index)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint32_t regval = 0;
  uint32_t offset = 0;

  switch (index)
    {
      case HRTIM_CAPTURE1:
        {
          offset = STM32_HRTIM_TIM_CPT1R_OFFSET;
          break;
        }

      case HRTIM_CAPTURE2:
        {
          offset = STM32_HRTIM_TIM_CPT2R_OFFSET;
          break;
        }

      default:
        {
          regval = 0;
          goto errout;
        }
    }

  regval = (uint16_t)hrtim_tim_getreg(priv, timer, offset);

errout:
  return regval;
}

/****************************************************************************
 * Name: hrtim_soft_capture
 *
 * Description:
 *   HRTIM Timer software capture tirgger.
 *
 * Input Parameters:
 *   dev    - HRTIM device structure
 *   timer  - HRTIM Timer indexes
 *   index  - HRTIM capture index
 *
 * Returned Value:
 *   0 on success; a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_soft_capture(struct hrtim_dev_s *dev, uint8_t timer,
                             uint8_t index)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint32_t offset = 0;

  switch (index)
    {
      case HRTIM_CAPTURE1:
        {
          offset = STM32_HRTIM_TIM_CPT1CR_OFFSET;
          break;
        }

      case HRTIM_CAPTURE2:
        {
          offset = STM32_HRTIM_TIM_CPT2CR_OFFSET;
          break;
        }

      default:
        {
          goto errout;
        }
    }

  /* Modify register */

  hrtim_tim_modifyreg(priv, timer, offset, 0, HRTIM_TIMCPT12CR_SWCPT);

errout:
  return OK;
}

#endif

/****************************************************************************
 * Name: hrtim_synch_config
 *
 * Description:
 *   Configure HRTIM Synchronization Input/Output
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_HRTIM_SYNC)
static int hrtim_synch_config(struct stm32_hrtim_s *priv)
{
#warning "hrtim_synch_config: missing logic"
  return OK;
}
#endif

/****************************************************************************
 * Name: hrtim_tim_outputs_config
 *
 * Description:
 *   Configure HRTIM Slave Timer Outputs (CH1 and CH2)
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_HRTIM_PWM)
static int hrtim_tim_outputs_config(struct stm32_hrtim_s *priv,
                                    uint8_t timer)
{
  struct stm32_hrtim_slave_priv_s *slave;
  uint32_t regval = 0;
  int ret = OK;

  /* Get Slave Timer data structure */

  slave = hrtim_slave_get(priv, timer);
  if (slave == NULL)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* Configure CH1 SET events */

  regval = slave->pwm.ch1.set;
  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_SET1R_OFFSET, regval);

  /* Configure CH1 RESET events */

  regval = slave->pwm.ch1.rst;
  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_RST1R_OFFSET, regval);

  /* Configure CH2 SET events */

  regval = slave->pwm.ch2.set;
  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_SET2R_OFFSET, regval);

  /* Configure CH2 RESET events */

  regval = slave->pwm.ch2.rst;
  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_RST2R_OFFSET, regval);

  /* Now we configure OUT register */

  regval = 0;

#ifdef CONFIG_STM32_HRTIM_BURST
  /* Configure IDLE state for output 1 */

  if (slave->pwm.burst.ch1_en)
    {
      /* Set IDLE mode */

