apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
      regval |= HRTIM_TIMOUT_IDLEM1;

      /* Set Idle state */

      regval |= ((slave->pwm.burst.ch1_state & HRTIM_IDLE_ACTIVE) ?
                 HRTIM_TIMOUT_IDLES1 : 0);
    }

  /* Configure IDLE state for output 2 */

  if (slave->pwm.burst.ch2_en)
    {
      /* Set IDLE mode */

      regval |= HRTIM_TIMOUT_IDLEM1;

      /* Set Idle state */

      regval |= ((slave->pwm.burst.ch2_state & HRTIM_IDLE_ACTIVE) ?
                 HRTIM_TIMOUT_IDLES1 : 0);
    }
#endif

#ifdef CONFIG_STM32_HRTIM_DEADTIME
  if (slave->pwm.dt.en == 1)
    {
      /* Set deadtime enable */

      regval |= HRTIM_TIMOUT_DTEN;

      /* TODO: deadtime upon burst mode Idle entry */
    }
#endif

  /* Configure Output 1 polarisation */

  regval |= ((slave->pwm.ch1.pol & HRTIM_OUT_POL_NEG) ?
             HRTIM_TIMOUT_POL1 : 0);

  /* Configure Output 2 polarisation */

  regval |= ((slave->pwm.ch2.pol & HRTIM_OUT_POL_NEG) ?
             HRTIM_TIMOUT_POL2 : 0);

  /* Write HRTIM Slave Timer Output register  */

  hrtim_tim_modifyreg(priv, timer, STM32_HRTIM_TIM_OUTR_OFFSET, 0, regval);

#ifdef CONFIG_STM32_HRTIM_PUSHPULL
  if (slave->pwm.pushpull == 1)
    {
      /* Enable push-pull mode */

      hrtim_tim_modifyreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET, 0,
                          HRTIM_TIMCR_PSHPLL);
    }
#endif

errout:
  return ret;
}
#endif

/****************************************************************************
 * Name: hrtim_outputs_config
 *
 * Description:
 *   Configure HRTIM Outputs
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_HRTIM_PWM)
static int hrtim_outputs_config(struct stm32_hrtim_s *priv)
{
  int ret = OK;

  /* Configure HRTIM TIMER A Outputs */

#ifdef CONFIG_STM32_HRTIM_TIMA_PWM
  ret = hrtim_tim_outputs_config(priv, HRTIM_TIMER_TIMA);
  if (ret < 0)
    {
      goto errout;
    }
#endif

  /* Configure HRTIM TIMER B Outputs */

#ifdef CONFIG_STM32_HRTIM_TIMB_PWM
  ret = hrtim_tim_outputs_config(priv, HRTIM_TIMER_TIMB);
  if (ret < 0)
    {
      goto errout;
    }
#endif

  /* Configure HRTIM TIMER C Outputs */

#ifdef CONFIG_STM32_HRTIM_TIMC_PWM
  ret = hrtim_tim_outputs_config(priv, HRTIM_TIMER_TIMC);
  if (ret < 0)
    {
      goto errout;
    }
#endif

  /* Configure HRTIM TIMER D Outputs */

#ifdef CONFIG_STM32_HRTIM_TIMD_PWM
  ret = hrtim_tim_outputs_config(priv, HRTIM_TIMER_TIMD);
  if (ret < 0)
    {
      goto errout;
    }
#endif

  /* Configure HRTIM TIMER E Outputs */

#ifdef CONFIG_STM32_HRTIM_TIME_PWM
  ret = hrtim_tim_outputs_config(priv, HRTIM_TIMER_TIME);
  if (ret < 0)
    {
      goto errout;
    }
#endif

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_outputs_enable
 *
 * Description:
 *   Enable/disable HRTIM outputs (bulk operation)
 *
 * Input Parameters:
 *   dev     - HRTIM device structure
 *   outputs - outputs to set
 *   state   - Enable/disable operation
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_outputs_enable(struct hrtim_dev_s *dev,
                                uint16_t outputs, bool state)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint32_t offset = 0;

  /* Get register offset */

  if (state == true)
    {
      offset = STM32_HRTIM_CMN_OENR_OFFSET;
    }
  else
    {
      offset = STM32_HRTIM_CMN_ODISR_OFFSET;
    }

  /* Write register */

  hrtim_cmn_putreg(priv, offset, outputs);

  return OK;
}

/****************************************************************************
 * Name: output_tim_index_get
 ****************************************************************************/

static uint8_t output_tim_index_get(uint16_t output)
{
  uint8_t timer = 0;

  switch (output)
    {
#ifdef CONFIG_STM32_HRTIM_TIMA
      case HRTIM_OUT_TIMA_CH1:
      case HRTIM_OUT_TIMA_CH2:
        {
          timer = HRTIM_TIMER_TIMA;
          break;
        }
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB
      case HRTIM_OUT_TIMB_CH1:
      case HRTIM_OUT_TIMB_CH2:
        {
          timer = HRTIM_TIMER_TIMB;
          break;
        }
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC
      case HRTIM_OUT_TIMC_CH1:
      case HRTIM_OUT_TIMC_CH2:
        {
          timer = HRTIM_TIMER_TIMC;
          break;
        }
#endif

#ifdef CONFIG_STM32_HRTIM_TIMD
      case HRTIM_OUT_TIMD_CH1:
      case HRTIM_OUT_TIMD_CH2:
        {
          timer = HRTIM_TIMER_TIMD;
          break;
        }
#endif

#ifdef CONFIG_STM32_HRTIM_TIME
      case HRTIM_OUT_TIME_CH1:
      case HRTIM_OUT_TIME_CH2:
        {
          timer = HRTIM_TIMER_TIME;
          break;
        }
#endif

      default:
        {
          timer = 0;
          break;
        }
    }

  return timer;
}

/****************************************************************************
 * Name: output_tim_ch_get
 ****************************************************************************/

static uint8_t output_tim_ch_get(uint16_t output)
{
  uint8_t ch = 0;

  switch (output)
    {
#ifdef CONFIG_STM32_HRTIM_TIMA
      case HRTIM_OUT_TIMA_CH1:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB
      case HRTIM_OUT_TIMB_CH1:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC
      case HRTIM_OUT_TIMC_CH1:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD
      case HRTIM_OUT_TIMD_CH1:
#endif
#ifdef CONFIG_STM32_HRTIM_TIME
      case HRTIM_OUT_TIME_CH1:
#endif
        {
          ch = HRTIM_OUT_CH1;
          break;
        }

#ifdef CONFIG_STM32_HRTIM_TIMA
      case HRTIM_OUT_TIMA_CH2:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB
      case HRTIM_OUT_TIMB_CH2:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC
      case HRTIM_OUT_TIMC_CH2:
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD
      case HRTIM_OUT_TIMD_CH2:
#endif
#ifdef CONFIG_STM32_HRTIM_TIME
      case HRTIM_OUT_TIME_CH2:
#endif
        {
          ch = HRTIM_OUT_CH2;
          break;
        }

      default:
        {
          ch = 0;
          break;
        }
    }

