apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
  return ch;
}

/****************************************************************************
 * Name: hrtim_output_set_set
 ****************************************************************************/

static int hrtim_output_set_set(struct hrtim_dev_s *dev, uint16_t output,
                                uint32_t set)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  struct stm32_hrtim_slave_priv_s *slave;
  uint8_t timer = 0;
  int ret = OK;

  /* Get timer index from output */

  timer = output_tim_index_get(output);

  /* Get Slave Timer data structure */

  slave = hrtim_slave_get(priv, timer);
  if (slave == NULL)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* Set new SET value */

  switch (output_tim_ch_get(output))
    {
      case HRTIM_OUT_CH1:
        {
          slave->pwm.ch1.set = set;
          hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_SET1R_OFFSET, set);
          break;
        }

      case HRTIM_OUT_CH2:
        {
          slave->pwm.ch2.set = set;
          hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_SET2R_OFFSET, set);
          break;
        }

      default:
        {
          ret = -EINVAL;
          goto errout;
        }
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_output_rst_set
 ****************************************************************************/

static int hrtim_output_rst_set(struct hrtim_dev_s *dev, uint16_t output,
                                uint32_t rst)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  struct stm32_hrtim_slave_priv_s *slave;
  uint8_t timer = 0;
  int ret = OK;

  /* Get timer index from output */

  timer = output_tim_index_get(output);

  /* Get Salve Timer data structure */

  slave = hrtim_slave_get(priv, timer);
  if (slave == NULL)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* Set new RST value */

  switch (output_tim_ch_get(output))
    {
      case HRTIM_OUT_CH1:
        {
          slave->pwm.ch1.rst = rst;
          hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_RST1R_OFFSET, rst);
        }

      case HRTIM_OUT_CH2:
        {
          slave->pwm.ch2.rst = rst;
          hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_RST2R_OFFSET, rst);
        }

      default:
        {
          ret = -EINVAL;
          goto errout;
        }
    }

errout:
  return ret;
}

#endif

/****************************************************************************
 * Name: hrtim_adc_config
 *
 * Description:
 *   Configure HRTIM ADC triggers
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

#ifdef HRTIM_HAVE_ADC
static int hrtim_adc_config(struct stm32_hrtim_s *priv)
{
  /* Configure ADC Trigger 1 */

#ifdef HRTIM_HAVE_ADC_TRG1
  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_ADC1R_OFFSET, priv->adc->trg1);
#endif

  /* Configure ADC Trigger 2 */

#ifdef HRTIM_HAVE_ADC_TRG2
  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_ADC2R_OFFSET, priv->adc->trg2);
#endif

  /* Configure ADC Trigger 3 */

#ifdef HRTIM_HAVE_ADC_TRG3
  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_ADC3R_OFFSET, priv->adc->trg3);
#endif

  /* Configure ADC Trigger 4 */

#ifdef HRTIM_HAVE_ADC_TRG4
  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_ADC4R_OFFSET, priv->adc->trg4);
#endif

  return OK;
}
#endif

#ifdef CONFIG_STM32_HRTIM_DAC
/****************************************************************************
 * Name: hrtim_tim_dac_cfg
 *
 * Description:
 *   Configure single HRTIM Timer DAC synchronization event
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *   timer  - Timer index
 *   dac    - DAC synchronisation event configuration
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_tim_dac_cfg(struct stm32_hrtim_s *priv, uint8_t timer,
                             uint8_t dac)
{
  struct stm32_hrtim_tim_s *tim;
  uint32_t regval = 0;

  tim = hrtim_tim_get(priv, timer);

  regval = hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET);

  regval |= (dac << HRTIM_CMNCR_DACSYNC_SHIFT);

  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET, regval);

  return OK;
}

/****************************************************************************
 * Name: hrtim_dac_config
 *
 * Description:
 *   Configure HRTIM DAC synchronization
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_dac_config(struct stm32_hrtim_s *priv)
{
  struct stm32_hrtim_timcmn_s *tim;

  /* Configure DAC synchronization for Master Timer */

#ifdef CONFIG_STM32_HRTIM_MASTER_DAC
  tim = (struct stm32_hrtim_timcmn_s *)priv->master;
  hrtim_tim_dac_cfg(priv, HRTIM_TIMER_MASTER, tim->dac);
#endif

  /* Configure DAC synchronization for Timer A */

#ifdef CONFIG_STM32_HRTIM_TIMA_DAC
  tim = (struct stm32_hrtim_timcmn_s *)priv->tima;
  hrtim_tim_dac_cfg(priv, HRTIM_TIMER_TIMA, tim->dac);
#endif

  /* Configure DAC synchronization for Timer B */

#ifdef CONFIG_STM32_HRTIM_TIMB_DAC
  tim = (struct stm32_hrtim_timcmn_s *)priv->timb;
  hrtim_tim_dac_cfg(priv, HRTIM_TIMER_TIMB, tim->dac);
#endif

  /* Configure DAC synchronization for Timer C */

#ifdef CONFIG_STM32_HRTIM_TIMC_DAC
  tim = (struct stm32_hrtim_timcmn_s *)priv->timc;
  hrtim_tim_dac_cfg(priv, HRTIM_TIMER_TIMC, tim->dac);
#endif

  /* Configure DAC synchronization for Timer D */

#ifdef CONFIG_STM32_HRTIM_TIMD_DAC
  tim = (struct stm32_hrtim_timcmn_s *)priv->timd;
  hrtim_tim_dac_cfg(priv, HRTIM_TIMER_TIMD, tim->dac);
#endif

  /* Configure DAC synchronization for Timer E */

#ifdef CONFIG_STM32_HRTIM_TIME_DAC
  tim = (struct stm32_hrtim_timcmn_s *)priv->time;
  hrtim_tim_dac_cfg(priv, HRTIM_TIMER_TIME, tim->dac);
#endif

  return OK;
}
#endif

#ifdef CONFIG_STM32_HRTIM_DMA
/****************************************************************************
 * Name: hrtim_dma_cfg
 ****************************************************************************/

static int hrtim_tim_dma_cfg(struct stm32_hrtim_s *priv, uint8_t timer,
                             uint16_t dma)
{
  int ret = OK;
  uint32_t regval = 0;

  /* Sanity checking */

