apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
  if (timer == HRTIM_TIMER_COMMON)
    {
      ret = -EINVAL;
      goto errout;
    }

  if (timer == HRTIM_TIMER_MASTER)
    {
      /* Master support first 7 DMA requests */

      if (dma > 0x7f)
        {
          tmrerr("ERROR: invalid DMA requests 0x%04X for timer %d\n", dma,
                 timer);
          ret = -EINVAL;
          goto errout;
        }
    }
  else
    {
      if (dma & HRTIM_DMA_SYNC)
        {
          tmrerr("ERROR: timer %d does not support 0x%04X DMA request\n",
                 timer, HRTIM_DMA_SYNC);
          ret = -EINVAL;
          goto errout;
        }
    }

  /* DMA configuration occupies upper half of the DIER register */

  regval = dma << 16;

  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_DIER_OFFSET, regval);

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_dma_cfg
 ****************************************************************************/

static int hrtim_dma_cfg(struct stm32_hrtim_s *priv)
{
#ifdef CONFIG_STM32_HRTIM_MASTER_DMA
  hrtim_tim_dma_cfg(priv, HRTIM_TIMER_MASTER, priv->master->tim.dma);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMA_DMA
  hrtim_tim_dma_cfg(priv, HRTIM_TIMER_TIMA, priv->tima->tim.dma);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB_DMA
  hrtim_tim_dma_cfg(priv, HRTIM_TIMER_TIMB, priv->timb->tim.dma);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC_DMA
  hrtim_tim_dma_cfg(priv, HRTIM_TIMER_TIMC, priv->timc->tim.dma);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMD_DMA
  hrtim_tim_dma_cfg(priv, HRTIM_TIMER_TIMD, priv->timd->tim.dma);
#endif

#ifdef CONFIG_STM32_HRTIM_TIME_DMA
  hrtim_tim_dma_cfg(priv, HRTIM_TIMER_TIME, priv->time->tim.dma);
#endif

  return OK;
}
#endif /* CONFIG_STM32_HRTIM_DAM */

#ifdef CONFIG_STM32_HRTIM_DEADTIME
/****************************************************************************
 * Name: hrtim_deadtime_update
 ****************************************************************************/

static int hrtim_deadtime_update(struct hrtim_dev_s *dev, uint8_t timer,
                                 uint8_t dt, uint16_t value)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  int      ret    = OK;
  uint32_t regval = 0;
  uint32_t shift  = 0;
  uint32_t mask   = 0;

  /* For safety reasons we saturate deadtime value if it exceeds
   * the acceptable range.
   */

  if (value > 0x1ff)
    {
      value = 0x1ff;
    }

  /* Get shift value */

  switch (dt)
    {
      case HRTIM_DT_EDGE_RISING:
        {
          shift = HRTIM_TIMDT_DTR_SHIFT;
          mask  = HRTIM_TIMDT_DTR_MASK;
          break;
        }

      case HRTIM_DT_EDGE_FALLING:
        {
          shift = HRTIM_TIMDT_DTF_SHIFT;
          mask  = HRTIM_TIMDT_DTF_MASK;
          break;
        }

      default:
        {
          ret = -EINVAL;
          goto errout;
        }
    }

  regval = value << shift;

  /* Update register */

  hrtim_tim_modifyreg(priv, timer, STM32_HRTIM_TIM_DTR_OFFSET, mask, regval);

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_deadtime_get
 ****************************************************************************/

static uint16_t hrtim_deadtime_get(struct hrtim_dev_s *dev,
                                   uint8_t timer, uint8_t dt)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint16_t regval = 0;
  uint32_t shift  = 0;
  uint32_t mask   = 0;

  /* Get shift value */

  switch (dt)
    {
      case HRTIM_DT_EDGE_RISING:
        {
          shift = HRTIM_TIMDT_DTR_SHIFT;
          mask  = HRTIM_TIMDT_DTR_MASK;
          break;
        }

      case HRTIM_DT_EDGE_FALLING:
        {
          shift = HRTIM_TIMDT_DTF_SHIFT;
          mask  = HRTIM_TIMDT_DTF_MASK;
          break;
        }

      default:
        {
          regval = 0;
          goto errout;
        }
    }

  /* Get Deadtime Register */

  regval = hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_DTR_OFFSET);

  /* Get Deadtime value  */

  regval = (regval & mask) >> shift;

errout:
  return regval;
}

/****************************************************************************
 * Name: hrtim_tim_deadtime_cfg
 ****************************************************************************/

static int hrtim_tim_deadtime_cfg(struct stm32_hrtim_s *priv,
                                  uint8_t timer)
{
  struct stm32_hrtim_slave_priv_s *slave;
  uint32_t regval = 0;
  int ret = OK;

  /* Sanity checking */

  if (timer == HRTIM_TIMER_MASTER || timer == HRTIM_TIMER_COMMON)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* Get Slave Timer data structure */

  slave = hrtim_slave_get(priv, timer);
  if (slave == NULL)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* Configure deadtime prescaler  */

  regval |= slave->pwm.dt.prescaler  << HRTIM_TIMDT_DTPRSC_SHIFT;

  /* Configure rising deadtime  */

  regval |= slave->pwm.dt.rising  << HRTIM_TIMDT_DTR_SHIFT;

  /* Configure falling deadtime */

  regval |= slave->pwm.dt.falling << HRTIM_TIMDT_DTF_SHIFT;

  /* Configure falling deadtime sign */

  if (slave->pwm.dt.fsign == HRTIM_DT_SIGN_NEGATIVE)
    {
      regval |= HRTIM_TIMDT_SDTF;
    }

  /* Configure risign deadtime sign */

  if (slave->pwm.dt.rsign == HRTIM_DT_SIGN_NEGATIVE)
    {
      regval |= HRTIM_TIMDT_SDTR;
    }

  /* Configure falling sing lock */

  if (slave->pwm.dt.fsign_lock == HRTIM_DT_LOCK)
    {
      regval |= HRTIM_TIMDT_DTFSLK;
    }

  /* Configure rising sing lock */

  if (slave->pwm.dt.rsign_lock == HRTIM_DT_LOCK)
    {
      regval |= HRTIM_TIMDT_DTRSLK;
    }

  /* Configure rising value lock */

  if (slave->pwm.dt.rising_lock == HRTIM_DT_LOCK)
    {
      regval |= HRTIM_TIMDT_DTRLK;
    }

  /* Configure falling value lock */

  if (slave->pwm.dt.falling_lock == HRTIM_DT_LOCK)
    {
      regval |= HRTIM_TIMDT_DTFLK;
    }

  /* TODO: configure default deadtime values */

  /* Write register */

  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_DTR_OFFSET, regval);

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_deadtime_config
 ****************************************************************************/

static int hrtim_deadtime_config(struct stm32_hrtim_s *priv)
{
  /* Configure Timer A deadtime */

#ifdef CONFIG_STM32_HRTIM_TIMA_DT
  hrtim_tim_deadtime_cfg(priv, HRTIM_TIMER_TIMA);
#endif

  /* Configure Timer B deadtime */

#ifdef CONFIG_STM32_HRTIM_TIMB_DT
  hrtim_tim_deadtime_cfg(priv, HRTIM_TIMER_TIMB);
#endif

  /* Configure Timer C deadtime */

