apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
#ifdef CONFIG_STM32_HRTIM_TIMC_DT
  hrtim_tim_deadtime_cfg(priv, HRTIM_TIMER_TIMC);
#endif

  /* Configure Timer D deadtime */

#ifdef CONFIG_STM32_HRTIM_TIMD_DT
  hrtim_tim_deadtime_cfg(priv, HRTIM_TIMER_TIMD);
#endif

  /* Configure Timer E deadtime */

#ifdef CONFIG_STM32_HRTIM_TIME_DT
  hrtim_tim_deadtime_cfg(priv, HRTIM_TIMER_TIME);
#endif

  return OK;
}
#endif /* CONFIG_STM32_HRTIM_DEADTIME */

#ifdef CONFIG_STM32_HRTIM_CHOPPER
/****************************************************************************
 * Name: hrtim_chopper_enable
 *
 * Description:
 *   Enable/disable HRTIM outputs (bulk operation)
 *
 * Input Parameters:
 *   dev     - HRTIM device structure
 *   timer   - An HRTIM Timer index
 *   chan    - Output channel
 *   state   - Enable/disable operation
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_chopper_enable(struct hrtim_dev_s *dev, uint8_t timer,
                                uint8_t chan, bool state)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint32_t val = 0;
  int ret = OK;

  /* Get bit to change */

  switch (chan)
    {
      case HRTIM_OUT_CH1:
        {
          val = HRTIM_TIMOUT_CHP1;
          break;
        }

      case HRTIM_OUT_CH2:
        {
          val = HRTIM_TIMOUT_CHP2;
          break;
        }

      default:
        {
          ret = -EINVAL;
          goto errout;
        }
    }

  /* Update register  */

  if (state == true)
    {
      /* Set enable bit */

      hrtim_tim_modifyreg(priv, timer, STM32_HRTIM_TIM_OUTR_OFFSET, 0, val);
    }
  else
    {
      /* Clear enable bit */

      hrtim_tim_modifyreg(priv, timer, STM32_HRTIM_TIM_OUTR_OFFSET, val, 0);
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_chopper_cfg
 ****************************************************************************/

static int hrtim_tim_chopper_cfg(struct stm32_hrtim_s *priv,
                                 uint8_t timer)
{
  struct stm32_hrtim_slave_priv_s *slave;

  int ret = OK;
  uint32_t regval = 0;

  /* Sanity checking */

  if (timer == HRTIM_TIMER_MASTER || timer == HRTIM_TIMER_COMMON)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* Get Slave Timer data structure */

  slave = hrtim_slave_get(priv, timer);
  if (slave == NULL)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* Configure start pulsewidth */

  regval |= slave->pwm.chp.start_pulse << HRTIM_TIMCHP_STRTPW_SHIFT;

  /* Configure chopper duty cycle */

  regval |= slave->pwm.chp.duty << HRTIM_TIMCHP_CARDTY_SHIFT;

  /* Configure carrier frequency */

  regval |= slave->pwm.chp.freq << HRTIM_TIMCHP_CARFRQ_SHIFT;

  /* Write register */

  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_CHPR_OFFSET, regval);

errout:
  return OK;
}

/****************************************************************************
 * Name: hrtim_chopper_config
 ****************************************************************************/

static int hrtim_chopper_config(struct stm32_hrtim_s *priv)
{
  /* Configure chopper for Timer A */

#ifdef CONFIG_STM32_HRTIM_TIMA_CHOP
  hrtim_tim_chopper_cfg(priv, HRTIM_TIMER_TIMA);
#endif

  /* Configure chopper for Timer B */

#ifdef CONFIG_STM32_HRTIM_TIMB_CHOP
  hrtim_tim_chopper_cfg(priv, HRTIM_TIMER_TIMB);
#endif

  /* Configure chopper for Timer C */

#ifdef CONFIG_STM32_HRTIM_TIMC_CHOP
  hrtim_tim_chopper_cfg(priv, HRTIM_TIMER_TIMC);
#endif

  /* Configure chopper for Timer D */

#ifdef CONFIG_STM32_HRTIM_TIMD_CHOP
  hrtim_tim_chopper_cfg(priv, HRTIM_TIMER_TIMD);
#endif

  /* Configure chopper for Timer E */

#ifdef CONFIG_STM32_HRTIM_TIME_CHOP
  hrtim_tim_chopper_cfg(priv, HRTIM_TIMER_TIME);
#endif

  return OK;
}
#endif

#ifdef CONFIG_STM32_HRTIM_BURST
/****************************************************************************
 * Name: hrtim_burst_enable
 ****************************************************************************/

static int hrtim_burst_enable(struct hrtim_dev_s *dev, bool state)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;

  if (state)
    {
      /* Enable Burst mode */

      hrtim_cmn_modifyreg(priv, STM32_HRTIM_CMN_BMCR_OFFSET, 0,
                          HRTIM_BMCR_BME);

      /* Software start */

      hrtim_cmn_modifyreg(priv, STM32_HRTIM_CMN_BMTRGR_OFFSET, 0,
                          HRTIM_BMTRGR_SW);
    }
  else
    {
      /* Disable Burst mode */

      hrtim_cmn_modifyreg(priv, STM32_HRTIM_CMN_BMCR_OFFSET,
                          HRTIM_BMCR_BME, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: hrtim_burst_cmp_update
 ****************************************************************************/

static int hrtim_burst_cmp_update(struct hrtim_dev_s *dev, uint16_t cmp)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;

  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_BMCMPR_OFFSET, cmp);

  return OK;
}

/****************************************************************************
 * Name: hrtim_burst_per_update
 ****************************************************************************/

static int hrtim_burst_per_update(struct hrtim_dev_s *dev, uint16_t per)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;

  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_BMPER_OFFSET, per);

  return OK;
}

/****************************************************************************
 * Name: hrtim_burst_cmp_get
 ****************************************************************************/

static uint16_t hrtim_burst_cmp_get(struct hrtim_dev_s *dev)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;

  return (uint16_t)hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BMCMPR_OFFSET);
}

/****************************************************************************
 * Name: hrtim_burst_per_get
 ****************************************************************************/

static uint16_t hrtim_burst_per_get(struct hrtim_dev_s *dev)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;

  return (uint16_t)hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_BMPER_OFFSET);
}

/****************************************************************************
 * Name: hrtim_burst_pre_update
 ****************************************************************************/

static int hrtim_burst_pre_update(struct hrtim_dev_s *dev, uint8_t pre)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  int ret = OK;
  uint32_t regval = 0;

  /* Sanity checking */

  if (priv->burst->clk != HRTIM_BURST_CLOCK_HRTIM)
    {
      ret = -EPERM;
      goto errout;
    }

  if (pre > HRTIM_BURST_PRESCALER_32768)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* Make sure that Burst mode is disabled */

  hrtim_burst_enable(dev, false);

  /* Change prescaler */

  priv->burst->presc = pre;
  regval = pre << HRTIM_BMCR_BMPRSC_SHIFT;

  hrtim_cmn_modifyreg(priv, STM32_HRTIM_CMN_BMCR_OFFSET,
                      HRTIM_BMCR_BMPRSC_MASK, regval);

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_burst_pre_get
 ****************************************************************************/

static int hrtim_burst_pre_get(struct hrtim_dev_s *dev)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  int ret = OK;

  if (priv->burst->clk != HRTIM_BURST_CLOCK_HRTIM)
    {
      ret = -EPERM;
      goto errout;
    }

