apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
#ifdef CONFIG_STM32_HRTIM_COMMON_IRQ
  hrtim_irq_cfg(priv, HRTIM_TIMER_COMMON, priv->irq);
#endif

  return OK;
}

/****************************************************************************
 * Name: hrtim_irq_ack
 ****************************************************************************/

static int hrtim_irq_ack(struct hrtim_dev_s *dev, uint8_t timer,
                         int source)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;

  if (timer == HRTIM_TIMER_COMMON)
    {
      /* Write to the HRTIM common clear interrupt register */

      hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_ICR_OFFSET, source);
    }
  else
    {
      /* Each timer has its own ICR register */

      hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_ICR_OFFSET, source);
    }

  return OK;
}

/****************************************************************************
 * Name: hrtim_irq_get
 ****************************************************************************/

static uint16_t hrtim_irq_get(struct hrtim_dev_s *dev, uint8_t timer)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint32_t regval = 0;

  if (timer == HRTIM_TIMER_COMMON)
    {
      /* Get HRTIM common status interrupt register */

      regval = hrtim_cmn_getreg(priv, STM32_HRTIM_CMN_ISR_OFFSET);
    }
  else
    {
      /* Each timer has its own ISR register */

      regval = hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_ISR_OFFSET);
    }

  return (uint16_t)regval;
}
#endif /* CONFIG_STM32_HRTIM_INTERRUPTS */

/****************************************************************************
 * Name: hrtim_tim_mode_set
 *
 * Description:
 *  Set HRTIM Timer mode
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM block
 *   timer  - HRTIM Timer index
 *   mode   - Timer mode configuration
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void hrtim_tim_mode_set(struct stm32_hrtim_s *priv, uint8_t timer,
                               uint8_t mode)
{
  uint32_t regval = 0;

  regval = hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET);

  /* Configure preload */

  if (mode & HRTIM_MODE_PRELOAD)
    {
      regval |= HRTIM_CMNCR_PREEN;
    }

  /* Configure half mode */

  if (mode & HRTIM_MODE_HALF)
    {
      regval |= HRTIM_CMNCR_HALF;
    }

  /* Configure re-triggerable mode */

  if (mode & HRTIM_MODE_RETRIG)
    {
      regval |= HRTIM_CMNCR_RETRIG;
    }

  /* Configure continuous mode */

  if (mode & HRTIM_MODE_CONT)
    {
      regval |= HRTIM_CMNCR_CONT;
    }

  /* Write register */

  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET, regval);
}

/****************************************************************************
 * Name: hrtim_mode_config
 *
 * Description:
 *   Configure HRTIM Timers mode
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void hrtim_mode_config(struct stm32_hrtim_s *priv)
{
#ifdef CONFIG_STM32_HRTIM_MASTER
  hrtim_tim_mode_set(priv, HRTIM_TIMER_MASTER, priv->master->tim.mode);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMA
  hrtim_tim_mode_set(priv, HRTIM_TIMER_TIMA, priv->tima->tim.mode);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB
  hrtim_tim_mode_set(priv, HRTIM_TIMER_TIMB, priv->timb->tim.mode);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC
  hrtim_tim_mode_set(priv, HRTIM_TIMER_TIMC, priv->timc->tim.mode);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMD
  hrtim_tim_mode_set(priv, HRTIM_TIMER_TIMD, priv->timd->tim.mode);
#endif

#ifdef CONFIG_STM32_HRTIM_TIME
  hrtim_tim_mode_set(priv, HRTIM_TIMER_TIME, priv->time->tim.mode);
#endif
}

/****************************************************************************
 * Name: hrtim_cmpcap_mask_get
 *
 * Description:
 *   This function returns not significant bits in counter/capture
 *   registers for given HRTIM Timer index.
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *   timer  - HRTIM Timer index
 *
 * Returned Value:
 *   Not significant bits for counter/capture registers
 *
 ****************************************************************************/

static uint8_t hrtim_cmpcap_mask_get(struct stm32_hrtim_s *priv,
                                     uint8_t timer)
{
  struct stm32_hrtim_tim_s *tim;
  uint8_t mask = 0;

  /* Get Timer data structure */

  tim = hrtim_tim_get(priv, timer);
  if (tim == NULL)
    {
      mask = 0;
      goto errout;
    }

  /* Not significant bits depens on timer prescaler */

  switch (tim->tim.prescaler)
    {
      case HRTIM_PRESCALER_1:
        {
          mask = 0b11111;
          break;
        }

      case HRTIM_PRESCALER_2:
        {
          mask = 0b1111;
          break;
        }

      case HRTIM_PRESCALER_4:
        {
          mask = 0b111;
          break;
        }

      case HRTIM_PRESCALER_8:
        {
          mask = 0b11;
          break;
        }

      case HRTIM_PRESCALER_16:
        {
          mask = 0b1;
          break;
        }

      default:
        {
          mask = 0;
          break;
        }
    }

errout:
  return mask;
}

/****************************************************************************
 * Name: hrtim_cmp_update
 *
 * Description:
 *  Try update HRTIM Timer compare register.
 *
 * Input Parameters:
 *   dev    - HRTIM device structure
 *   timer  - HRTIM Timer index
 *   index  - Compare register timer
 *   cmp    - New compare register value
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_cmp_update(struct hrtim_dev_s *dev, uint8_t timer,
                            uint8_t index, uint16_t cmp)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  int ret = OK;
  uint32_t offset = 0;
  uint8_t mask = 0;

  switch (index)
    {
      case HRTIM_CMP1:
        {
          offset = STM32_HRTIM_TIM_CMP1R_OFFSET;
          break;
        }

      case HRTIM_CMP2:
        {
          offset = STM32_HRTIM_TIM_CMP2R_OFFSET;
          break;
        }

      case HRTIM_CMP3:
        {
          offset = STM32_HRTIM_TIM_CMP3R_OFFSET;
          break;
        }

