apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
      case HRTIM_CMP4:
        {
          offset = STM32_HRTIM_TIM_CMP4R_OFFSET;
          break;
        }

      default:
        {
          ret = -EINVAL;
          goto errout;
        }
    }

  /* REVISIT: what should we do if cmp value is not significant ?
   * At this moment we set compare register to the nearest significant value.
   */

  mask = hrtim_cmpcap_mask_get(priv, timer);
  if (cmp <= mask)
    {
      cmp = mask + 1;
    }

  hrtim_tim_putreg(priv, timer, offset, cmp);

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_per_update
 *
 * Description:
 *  Try update HRTIM Timer period register.
 *
 * Input Parameters:
 *   dev    - HRTIM device structure
 *   timer  - HRTIM Timer index
 *   per    - New period register value
 *
 * Returned Value:
 *   0 on success; a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_per_update(struct hrtim_dev_s *dev, uint8_t timer,
                            uint16_t per)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_PER_OFFSET, per);

  return OK;
}

/****************************************************************************
 * Name: hrtim_per_get
 *
 * Description:
 *  Get HRTIM Timer period value
 *
 * Input Parameters:
 *   dev    - HRTIM device structure
 *   timer  - HRTIM Timer index
 *
 * Returned Value:
 *   Timer period value
 *
 ****************************************************************************/

static uint16_t hrtim_per_get(struct hrtim_dev_s *dev, uint8_t timer)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;

  return (uint16_t)hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_PER_OFFSET);
}

/****************************************************************************
 * Name: hrtim_rep_update
 *
 * Description:
 *  Try update HRTIM Timer repetition register.
 *
 * Input Parameters:
 *   dev    - HRTIM device structure
 *   timer  - HRTIM Timer index
 *   rep    - New repetition register value
 *
 * Returned Value:
 *   0 on success; a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_rep_update(struct hrtim_dev_s *dev, uint8_t timer,
                            uint8_t rep)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_REPR_OFFSET, rep);

  return OK;
}

/****************************************************************************
 * Name: hrtim_cmp_update
 *
 * Description:
 *  Get HRTIM Timer compare register
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM block
 *   timer  - HRTIM Timer index
 *   index  - Compare register timer
 *
 * Returned Value:
 *   Timer compare value
 *
 ****************************************************************************/

static uint16_t hrtim_cmp_get(struct hrtim_dev_s *dev, uint8_t timer,
                         uint8_t index)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint16_t cmpx = 0;
  uint32_t offset = 0;

  switch (index)
    {
      case HRTIM_CMP1:
        {
          offset = STM32_HRTIM_TIM_CMP1R_OFFSET;
          break;
        }

      case HRTIM_CMP2:
        {
          offset = STM32_HRTIM_TIM_CMP2R_OFFSET;
          break;
        }

      case HRTIM_CMP3:
        {
          offset = STM32_HRTIM_TIM_CMP3R_OFFSET;
          break;
        }

      case HRTIM_CMP4:
        {
          offset = STM32_HRTIM_TIM_CMP4R_OFFSET;
          break;
        }

      default:
        {
          cmpx = 0;
          goto errout;
        }
    }

  cmpx = (uint16_t)hrtim_tim_getreg(priv, timer, offset);

errout:
  return cmpx;
}

/****************************************************************************
 * Name: hrtim_fclk_get
 *
 * Description:
 *  Get HRTIM Timer clock value
 *
 * Input Parameters:
 *   dev    - HRTIM device structure
 *   timer  - HRTIM Timer index
 *
 * Returned Value:
 *   Timer clock value
 *
 ****************************************************************************/

static uint64_t hrtim_fclk_get(struct hrtim_dev_s *dev, uint8_t timer)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  struct stm32_hrtim_tim_s *tim;
  uint64_t fclk = 0;

  /* Get Timer data structure */

  tim = hrtim_tim_get(priv, timer);
  if (tim == NULL)
    {
      fclk = 0;
      goto errout;
    }

  fclk = tim->tim.fclk;

errout:
  return fclk;
}

/****************************************************************************
 * Name: hrtim_soft_update
 *
 * Description:
 *   HRTIM Timer software update.
 *   This is bulk operation, so we can update many registers at the same
 *   time.
 *
 * Input Parameters:
 *   dev    - HRTIM device structure
 *   timer  - HRTIM Timer indexes
 *
 * Returned Value:
 *   0 on success; a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_soft_update(struct hrtim_dev_s *dev, uint8_t timer)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint32_t regval = 0;

  regval |= (timer & HRTIM_TIMER_MASTER ? HRTIM_CR2_MSWU : 0);
#ifdef CONFIG_STM32_HRTIM_TIMA
  regval |= (timer & HRTIM_TIMER_TIMA ? HRTIM_CR2_TASWU : 0);
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB
  regval |= (timer & HRTIM_TIMER_TIMB ? HRTIM_CR2_TBSWU : 0);
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC
  regval |= (timer & HRTIM_TIMER_TIMC ? HRTIM_CR2_TCSWU : 0);
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD
  regval |= (timer & HRTIM_TIMER_TIMD ? HRTIM_CR2_TDSWU : 0);
#endif
#ifdef CONFIG_STM32_HRTIM_TIME
  regval |= (timer & HRTIM_TIMER_TIME ? HRTIM_CR2_TESWU : 0);
#endif

  /* Bits in HRTIM CR2 common register are automatically reset,
   * so we can just write to it.
   */

  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_CR2_OFFSET, regval);

  return OK;
}

/****************************************************************************
 * Name: hrtim_soft_reset
 *
 * Description:
 *   HRTIM Timer software reset.
 *   This is bulk operation, so we can update many registers at the same
 *   time.
 *
 * Input Parameters:
 *   dev    - HRTIM device structure
 *   timer  - HRTIM Timer indexes
 *
 * Returned Value:
 *   0 on success; a negated errno value on failure
 *
 ****************************************************************************/

