apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
static int hrtim_soft_reset(struct hrtim_dev_s *dev, uint8_t timer)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint32_t regval = 0;

  regval |= (timer & HRTIM_TIMER_MASTER ? HRTIM_CR2_MRST : 0);
#ifdef CONFIG_STM32_HRTIM_TIMA
  regval |= (timer & HRTIM_TIMER_TIMA ? HRTIM_CR2_TARST : 0);
#endif
#ifdef CONFIG_STM32_HRTIM_TIMB
  regval |= (timer & HRTIM_TIMER_TIMB ? HRTIM_CR2_TBRST : 0);
#endif
#ifdef CONFIG_STM32_HRTIM_TIMC
  regval |= (timer & HRTIM_TIMER_TIMC ? HRTIM_CR2_TCRST : 0);
#endif
#ifdef CONFIG_STM32_HRTIM_TIMD
  regval |= (timer & HRTIM_TIMER_TIMD ? HRTIM_CR2_TDRST : 0);
#endif
#ifdef CONFIG_STM32_HRTIM_TIME
  regval |= (timer & HRTIM_TIMER_TIME ? HRTIM_CR2_TERST : 0);
#endif

  /* Bits in HRTIM CR2 common register are automatically reset,
   * so we can just write to it.
   */

  hrtim_cmn_putreg(priv, STM32_HRTIM_CMN_CR2_OFFSET, regval);

  return OK;
}

/****************************************************************************
 * Name: hrtim_tim_freq_set
 *
 * Description:
 *   Set HRTIM Timer frequency
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_tim_freq_set(struct hrtim_dev_s *dev, uint8_t timer,
                              uint64_t freq)
{
  uint64_t per = 0;
  uint64_t fclk = 0;
  int ret = OK;

  /* Get Timer period value for given frequency */

  fclk = HRTIM_FCLK_GET(dev, timer);
  per = fclk / freq;
  if (per > HRTIM_PER_MAX)
    {
      tmrerr("ERROR: can not achieve timer pwm "
             "freq=%" PRIu64 " if fclk=%" PRIu64 "\n",
             freq, fclk);
      ret = -EINVAL;
      goto errout;
    }

  /* Set Timer period value */

  HRTIM_PER_SET(dev, timer, (uint16_t)per);

errout:
  return ret;
}

/****************************************************************************
 * Name: hrtim_tim_enable
 *
 * Description:
 *   Enable/disable HRTIM timer counter (bulk operation)
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_tim_enable(struct hrtim_dev_s *dev, uint8_t timers,
                            bool state)
{
  struct stm32_hrtim_s *priv = (struct stm32_hrtim_s *)dev->hd_priv;
  uint32_t regval = 0;

  regval |= (timers & HRTIM_TIMERS_MASK) << HRTIM_MCR_TCEN_SHIFT;

  if (state == true)
    {
      /* Set bits */

      hrtim_tim_modifyreg(priv, HRTIM_TIMER_MASTER,
                          STM32_HRTIM_TIM_CR_OFFSET,
                          0, regval);
    }
  else
    {
      /* Clear bits */

      hrtim_tim_modifyreg(priv, HRTIM_TIMER_MASTER,
                          STM32_HRTIM_TIM_CR_OFFSET,
                          regval, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: hrtim_tim_reset_set
 *
 * Description:
 *  Set HRTIM Timer Reset events
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM block
 *   timer  - HRTIM Timer index
 *   reset  - Reset configuration
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int hrtim_tim_reset_set(struct stm32_hrtim_s *priv, uint8_t timer,
                               uint64_t reset)
{
  int ret = OK;
  uint32_t regval = 0;

  /* Sanity checking */

  if (timer == HRTIM_TIMER_MASTER || timer == HRTIM_TIMER_COMMON)
    {
      ret = -EINVAL;
      goto errout;
    }

  /* First 18 bits can be written directly */

  regval |= (reset & 0x3ffff);

  /* TimerX reset events differ for individual timers */

  switch (timer)
    {
#ifdef CONFIG_STM32_HRTIM_TIMA
      case HRTIM_TIMER_TIMA:
        {
          regval |= ((reset & HRTIM_RST_TBCMP1) ?
                     HRTIM_TIMARST_TIMBCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP2) ?
                     HRTIM_TIMARST_TIMBCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP4) ?
                     HRTIM_TIMARST_TIMBCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP1) ?
                     HRTIM_TIMARST_TIMCCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP2) ?
                     HRTIM_TIMARST_TIMCCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP4) ?
                     HRTIM_TIMARST_TIMCCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP1) ?
                     HRTIM_TIMARST_TIMDCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP2) ?
                     HRTIM_TIMARST_TIMDCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP4) ?
                     HRTIM_TIMARST_TIMDCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TECMP1) ?
                     HRTIM_TIMARST_TIMECMP1 : 0);
          regval |= ((reset & HRTIM_RST_TECMP2) ?
                     HRTIM_TIMARST_TIMECMP2 : 0);
          regval |= ((reset & HRTIM_RST_TECMP4) ?
                     HRTIM_TIMARST_TIMECMP4 : 0);
          break;
        }
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB
      case HRTIM_TIMER_TIMB:
        {
          regval |= ((reset & HRTIM_RST_TACMP1) ?
                     HRTIM_TIMBRST_TIMACMP1 : 0);
          regval |= ((reset & HRTIM_RST_TACMP2) ?
                     HRTIM_TIMBRST_TIMACMP2 : 0);
          regval |= ((reset & HRTIM_RST_TACMP4) ?
                     HRTIM_TIMBRST_TIMACMP4 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP1) ?
                     HRTIM_TIMBRST_TIMCCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP2) ?
                     HRTIM_TIMBRST_TIMCCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP4) ?
                     HRTIM_TIMBRST_TIMCCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP1) ?
                     HRTIM_TIMBRST_TIMDCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP2) ?
                     HRTIM_TIMBRST_TIMDCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP4) ?
                     HRTIM_TIMBRST_TIMDCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TECMP1) ?
                     HRTIM_TIMBRST_TIMECMP1 : 0);
          regval |= ((reset & HRTIM_RST_TECMP2) ?
                     HRTIM_TIMBRST_TIMECMP2 : 0);
          regval |= ((reset & HRTIM_RST_TECMP4) ?
                     HRTIM_TIMBRST_TIMECMP4 : 0);
          break;
        }
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC
      case HRTIM_TIMER_TIMC:
        {
          regval |= ((reset & HRTIM_RST_TACMP1) ?
                     HRTIM_TIMCRST_TIMACMP1 : 0);
          regval |= ((reset & HRTIM_RST_TACMP2) ?
                     HRTIM_TIMCRST_TIMACMP2 : 0);
          regval |= ((reset & HRTIM_RST_TACMP4) ?
                     HRTIM_TIMCRST_TIMACMP4 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP1) ?
                     HRTIM_TIMCRST_TIMBCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP2) ?
                     HRTIM_TIMCRST_TIMBCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP4) ?
                     HRTIM_TIMCRST_TIMBCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP1) ?
                     HRTIM_TIMCRST_TIMDCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP2) ?
                     HRTIM_TIMCRST_TIMDCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP4) ?
                     HRTIM_TIMCRST_TIMDCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TECMP1) ?
                     HRTIM_TIMCRST_TIMECMP1 : 0);
          regval |= ((reset & HRTIM_RST_TECMP2) ?
                     HRTIM_TIMCRST_TIMECMP2 : 0);
          regval |= ((reset & HRTIM_RST_TECMP4) ?
                     HRTIM_TIMCRST_TIMECMP4 : 0);
          break;
        }
#endif

