apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
#ifdef CONFIG_STM32_HRTIM_TIMD
      case HRTIM_TIMER_TIMD:
        {
          regval |= ((reset & HRTIM_RST_TACMP1) ?
                     HRTIM_TIMDRST_TIMACMP1 : 0);
          regval |= ((reset & HRTIM_RST_TACMP2) ?
                     HRTIM_TIMDRST_TIMACMP2 : 0);
          regval |= ((reset & HRTIM_RST_TACMP4) ?
                     HRTIM_TIMDRST_TIMACMP4 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP1) ?
                     HRTIM_TIMDRST_TIMBCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP2) ?
                     HRTIM_TIMDRST_TIMBCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP4) ?
                     HRTIM_TIMDRST_TIMBCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP1) ?
                     HRTIM_TIMDRST_TIMCCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP2) ?
                     HRTIM_TIMDRST_TIMCCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP4) ?
                     HRTIM_TIMDRST_TIMCCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TECMP1) ?
                     HRTIM_TIMDRST_TIMECMP1 : 0);
          regval |= ((reset & HRTIM_RST_TECMP2) ?
                     HRTIM_TIMDRST_TIMECMP2 : 0);
          regval |= ((reset & HRTIM_RST_TECMP4) ?
                     HRTIM_TIMDRST_TIMECMP4 : 0);
          break;
        }
#endif

#ifdef CONFIG_STM32_HRTIM_TIME
      case HRTIM_TIMER_TIME:
        {
          regval |= ((reset & HRTIM_RST_TACMP1) ?
                     HRTIM_TIMERST_TIMACMP1 : 0);
          regval |= ((reset & HRTIM_RST_TACMP2) ?
                     HRTIM_TIMERST_TIMACMP2 : 0);
          regval |= ((reset & HRTIM_RST_TACMP4) ?
                     HRTIM_TIMERST_TIMACMP4 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP1) ?
                     HRTIM_TIMERST_TIMBCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP2) ?
                     HRTIM_TIMERST_TIMBCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TBCMP4) ?
                     HRTIM_TIMERST_TIMBCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP1) ?
                     HRTIM_TIMERST_TIMCCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP2) ?
                     HRTIM_TIMERST_TIMCCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TCCMP4) ?
                     HRTIM_TIMERST_TIMCCMP4 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP1) ?
                     HRTIM_TIMERST_TIMDCMP1 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP2) ?
                     HRTIM_TIMERST_TIMDCMP2 : 0);
          regval |= ((reset & HRTIM_RST_TDCMP4) ?
                     HRTIM_TIMERST_TIMDCMP4 : 0);
          break;
        }
#endif

      default:
        {
          ret = -EINVAL;
          goto errout;
        }
    }

  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_RSTR_OFFSET, regval);

errout:
  return ret;
}

static int hrtim_reset_config(struct stm32_hrtim_s *priv)
{
  struct stm32_hrtim_slave_priv_s *slave;

#ifdef CONFIG_STM32_HRTIM_TIMA
  slave = (struct stm32_hrtim_slave_priv_s *)priv->tima->priv;
  hrtim_tim_reset_set(priv, HRTIM_TIMER_TIMA, slave->reset);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timb->priv;
  hrtim_tim_reset_set(priv, HRTIM_TIMER_TIMB, slave->reset);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timc->priv;
  hrtim_tim_reset_set(priv, HRTIM_TIMER_TIMC, slave->reset);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMD
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timd->priv;
  hrtim_tim_reset_set(priv, HRTIM_TIMER_TIMD, slave->reset);
#endif

#ifdef CONFIG_STM32_HRTIM_TIME
  slave = (struct stm32_hrtim_slave_priv_s *)priv->time->priv;
  hrtim_tim_reset_set(priv, HRTIM_TIMER_TIME, slave->reset);
#endif

  return OK;
}

static int hrtim_tim_update_set(struct stm32_hrtim_s *priv,
                                uint8_t timer,
                                uint16_t update)
{
  uint32_t regval = 0;

  regval = hrtim_tim_getreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET);

  /* Configure update events */

  regval |= (update & HRTIM_UPDATE_MSTU ? HRTIM_TIMCR_MSTU : 0);
  regval |= (update & HRTIM_UPDATE_RSTU ? HRTIM_TIMCR_RSTU : 0);
  regval |= (update & HRTIM_UPDATE_REPU ? HRTIM_TIMCR_REPU : 0);

#ifdef CONFIG_STM32_HRTIM_TIMA
  regval |= (update & HRTIM_UPDATE_TAU ? HRTIM_TIMCR_TAU : 0);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB
  regval |= (update & HRTIM_UPDATE_TBU ? HRTIM_TIMCR_TBU : 0);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC
  regval |= (update & HRTIM_UPDATE_TCU ? HRTIM_TIMCR_TCU : 0);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMD
  regval |= (update & HRTIM_UPDATE_TDU ? HRTIM_TIMCR_TDU : 0);
#endif

#ifdef CONFIG_STM32_HRTIM_TIME
  regval |= (update & HRTIM_UPDATE_TEU ? HRTIM_TIMCR_TEU : 0);
#endif

  /* TODO: Configure update gating */

  /* Write register */

  hrtim_tim_putreg(priv, timer, STM32_HRTIM_TIM_CR_OFFSET, regval);

  return OK;
}

static int hrtim_update_config(struct stm32_hrtim_s *priv)
{
  struct stm32_hrtim_slave_priv_s *slave;

#ifdef CONFIG_STM32_HRTIM_TIMA
  slave = (struct stm32_hrtim_slave_priv_s *)priv->tima->priv;
  hrtim_tim_update_set(priv, HRTIM_TIMER_TIMA, slave->update);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMB
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timb->priv;
  hrtim_tim_update_set(priv, HRTIM_TIMER_TIMB, slave->update);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMC
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timc->priv;
  hrtim_tim_update_set(priv, HRTIM_TIMER_TIMC, slave->update);
#endif

#ifdef CONFIG_STM32_HRTIM_TIMD
  slave = (struct stm32_hrtim_slave_priv_s *)priv->timd->priv;
  hrtim_tim_update_set(priv, HRTIM_TIMER_TIMD, slave->update);
#endif

#ifdef CONFIG_STM32_HRTIM_TIME
  slave = (struct stm32_hrtim_slave_priv_s *)priv->time->priv;
  hrtim_tim_update_set(priv, HRTIM_TIMER_TIME, slave->update);
#endif

  return OK;
}

/****************************************************************************
 * Name: stm32_hrtimconfig
 *
 * Description:
 *   Configure HRTIM
 *
 * Input Parameters:
 *   priv   - A reference to the HRTIM structure
 *
 * Returned Value:
 *   0 on success, a negated errno value on failure
 *
 ****************************************************************************/

