apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.c
static int stm32_hrtimconfig(struct stm32_hrtim_s *priv)
{
  int ret;
  uint32_t regval = 0;

  /* HRTIM DLL calibration */

  ret = hrtim_dll_cal(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM DLL calibration failed!\n");
      goto errout;
    }

  /* Configure Timers Clocks */

  ret = hrtim_tim_clocks_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM timers clock configuration failed!\n");
      goto errout;
    }

  /* Configure Timers reset events */

  hrtim_reset_config(priv);

  /* Configure Timers update events */

  hrtim_update_config(priv);

  /* Configure Timers mode */

  hrtim_mode_config(priv);

  /* Configure auto-delayed mode */

#ifdef CONFIG_STM32_HRTIM_AUTODELAYED
  hrtim_autodelayed_config(priv);
#endif

  /* Configure HRTIM GPIOs */

#if defined(CONFIG_STM32_HRTIM_PWM) || defined(CONFIG_STM32_HRTIM_SYNC)
  ret = hrtim_gpios_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM GPIOs configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure HRTIM capture */

#if defined(CONFIG_STM32_HRTIM_CAPTURE)
  ret = hrtim_capture_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM capture configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure Synchronisation IOs */

#if defined(CONFIG_STM32_HRTIM_SYNC)
  ret = hrtim_synch_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM synchronisation configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure HRTIM outputs deadtime */

#if defined(CONFIG_STM32_HRTIM_DEADTIME)
  ret = hrtim_deadtime_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM deadtime configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure HRTIM outputs GPIOs */

#if defined(CONFIG_STM32_HRTIM_PWM)
  ret = hrtim_outputs_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM outputs configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure ADC triggers */

#ifdef HRTIM_HAVE_ADC
  ret = hrtim_adc_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM ADC configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure DAC synchronization */

#ifdef CONFIG_STM32_HRTIM_DAC
  ret = hrtim_dac_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM ADC configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure Faults */

#ifdef CONFIG_STM32_HRTIM_FAULTS
  ret = hrtim_faults_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM faults configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure External Events */

#ifdef CONFIG_STM32_HRTIM_EVENTS
  ret = hrtim_events_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM EEV configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure interrupts */

#ifdef CONFIG_STM32_HRTIM_INTERRUPTS
  ret = hrtim_irq_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM IRQ configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure DMA */

#ifdef CONFIG_STM32_HRTIM_DMA
  ret = hrtim_dma_cfg(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM DMA configuration failed!\n");
      goto errout;
    }
#endif

  /* Configure burst mode */

#ifdef CONFIG_STM32_HRTIM_BURST
  ret = hrtim_burst_config(priv);
  if (ret != OK)
    {
      tmrerr("ERROR: HRTIM burst mode configuration failed!\n");
      goto errout;
    }
#endif

#ifndef CONFIG_STM32_HRTIM_NO_ENABLE_TIMERS
  /* Enable Master Timer */

#  ifdef CONFIG_STM32_HRTIM_MASTER
  regval |= HRTIM_MCR_MCEN;
#  endif

  /* Enable Slave Timers */

#  ifdef CONFIG_STM32_HRTIM_TIMA
  regval |= HRTIM_MCR_TACEN;
#  endif

#  ifdef CONFIG_STM32_HRTIM_TIMB
  regval |= HRTIM_MCR_TBCEN;
#  endif

#  ifdef CONFIG_STM32_HRTIM_TIMC
  regval |= HRTIM_MCR_TCCEN;
#  endif

#  ifdef CONFIG_STM32_HRTIM_TIMD
  regval |= HRTIM_MCR_TDCEN;
#  endif

#  ifdef CONFIG_STM32_HRTIM_TIME
  regval |= HRTIM_MCR_TECEN;
#  endif

#endif /* CONFIG_STM32_HRTIM_NO_ENABLE_TIMERS */

  /* Write enable bits at once */

  hrtim_tim_modifyreg(priv, HRTIM_TIMER_MASTER, STM32_HRTIM_TIM_CR_OFFSET,
                      0, regval);

  /* Dump registers for Master */

  hrtim_dumpregs(priv, HRTIM_TIMER_MASTER, "Master after configuration");

  /* Dump registers for Timer A */

#ifdef CONFIG_STM32_HRTIM_TIMA
  hrtim_dumpregs(priv, HRTIM_TIMER_TIMA, "Timer A after configuration");
#endif

  /* Dump registers for Timer B */

#ifdef CONFIG_STM32_HRTIM_TIMB
  hrtim_dumpregs(priv, HRTIM_TIMER_TIMB, "Timer B after configuration");
#endif

  /* Dump registers for Timer C */

#ifdef CONFIG_STM32_HRTIM_TIMC
  hrtim_dumpregs(priv, HRTIM_TIMER_TIMC, "Timer C after configuration");
#endif

  /* Dump registers for Timer D */

#ifdef CONFIG_STM32_HRTIM_TIMD
  hrtim_dumpregs(priv, HRTIM_TIMER_TIMD, "Timer D after configuration");
#endif

  /* Dump registers for Timer E */

#ifdef CONFIG_STM32_HRTIM_TIME
  hrtim_dumpregs(priv, HRTIM_TIMER_TIME, "Timer E after configuration");
#endif

  /* Dump common registers */

  hrtim_dumpregs(priv, HRTIM_TIMER_COMMON, "Common after configuration");

errout:
  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_hrtiminitialize
 *
 * Description:
 *   Initialize the HRTIM.
 *
 * Returned Value:
 *   Valid HRTIM device structure reference on success; a NULL on failure.
 *
 * Assumptions:
 *   1. Clock to the HRTIM block has enabled,
 *   2. Board-specific logic has already configured
 *
 ****************************************************************************/

struct hrtim_dev_s *stm32_hrtiminitialize(void)
{
  struct hrtim_dev_s  *dev;
  struct stm32_hrtim_s *hrtim;
  int ret;

  dev = &g_hrtim1dev;

  hrtim = dev->hd_priv;

  /* configure HRTIM only once */

  if (!dev->initialized)
    {
      ret = stm32_hrtimconfig(hrtim);
      if (ret < 0)
        {
          tmrerr("ERROR: Failed to initialize HRTIM1: %d\n", ret);
          return NULL;
        }

      dev->initialized = true;
    }

  return dev;
}

/****************************************************************************
 * Name: hrtim_register
 ****************************************************************************/

#ifndef CONFIG_STM32_HRTIM_DISABLE_CHARDRV
int hrtim_register(const char *path, struct hrtim_dev_s *dev)
{
  /* Initialize the HRTIM device structure */

  dev->hd_ocount = 0;

  /* Register the HRTIM character driver */

  return register_driver(path, &g_hrtim_fops, 0440, dev);
}
#endif /* CONFIG_STM32_HRTIM_DISABLE_CHARDRV */

#endif /* CONFIG_STM32_STM32F33XX || CONFIG_STM32_STM32G47XX */
#endif /* CONFIG_STM32_HRTIM1 */
